Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
<?xml version="1.0" encoding="UTF-8" standalone="no"?><device schemaVersion="1.3"><name>CH32V203G6U6</name><version>0.1.0</version><description>HAIR extraction for the WCH CH32V203G6U6 using the approved WCH datasheet/reference materials, official openwch SDK assets, and exact-family/variant structured cross-checks.</description><vendor>WCH</vendor><addressUnitBits>8</addressUnitBits><width>32</width><cpu><name>QingKe V4B</name><revision>V4B</revision><endian>little</endian><mpuPresent>false</mpuPresent><fpuPresent>false</fpuPresent><nvicPrioBits>4</nvicPrioBits><vendorSystickConfig>true</vendorSystickConfig></cpu><peripherals><peripheral><name>TIM2</name><description>General-purpose timer 2</description><baseAddress>0x40000000</baseAddress><groupName>TIM</groupName><addressBlock><offset>0x0</offset><size>0x4E</size><usage>registers</usage></addressBlock><interrupt><name>TIM2</name><description>TIM2</description><value>44</value></interrupt><registers><register><name>CTLR1</name><description>control register 1</description><addressOffset>0x0</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CEN</name><description>Counter enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>UDIS</name><description>Update disable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>URS</name><description>Update request source</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OPM</name><description>One-pulse mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CMS</name><description>Center-aligned mode selection</description><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>ARPE</name><description>Auto-reload preload enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CKD</name><description>Clock division</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>CTLR2</name><description>control register 2</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCPC</name><description>Compare selection</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CCUS</name><description>Update selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CCDS</name><description>Capture/compare DMA selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>MMS</name><description>Master mode selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>TI1S</name><description>TI1 selection</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS1</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS1N</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS2</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS2N</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS3</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS3N</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OIS4</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SMCFGR</name><description>slave mode control register</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SMS</name><description>Slave mode selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>TS</name><description>Trigger selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>MSM</name><description>Master/Slave mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ETF</name><description>External trigger filter</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>ETPS</name><description>External trigger prescaler</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>ECE</name><description>External clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ETP</name><description>External trigger polarity</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DMAINTENR</name><description>DMA/Interrupt enable register</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>UIE</name><description>Update interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IE</name><description>Capture/Compare 1 interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2IE</name><description>Capture/Compare 2 interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3IE</name><description>Capture/Compare 3 interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4IE</name><description>Capture/Compare 4 interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>COMIE</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TIE</name><description>Trigger interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BIE</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>UDE</name><description>Update DMA request enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1DE</name><description>Capture/Compare 1 DMA request enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2DE</name><description>Capture/Compare 2 DMA request enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3DE</name><description>Capture/Compare 3 DMA request enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4DE</name><description>Capture/Compare 4 DMA request enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>COMDE</name><description>COM DMA request enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>TDE</name><description>Trigger DMA request enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>INTFR</name><description>status register</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>UIF</name><description>Update interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1IF</name><description>Capture/compare 1 interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2IF</name><description>Capture/Compare 2 interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3IF</name><description>Capture/Compare 3 interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4IF</name><description>Capture/Compare 4 interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>COMIF</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TIF</name><description>Trigger interrupt flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BIF</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1OF</name><description>Capture/Compare 1 overcapture flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2OF</name><description>Capture/compare 2 overcapture flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3OF</name><description>Capture/Compare 3 overcapture flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4OF</name><description>Capture/Compare 4 overcapture flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWEVGR</name><description>event generation register</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>UG</name><description>Update generation</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1G</name><description>Capture/compare 1 generation</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2G</name><description>Capture/compare 2 generation</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3G</name><description>Capture/compare 3 generation</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4G</name><description>Capture/compare 4 generation</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>COMG</name><description>Capture/compare generation</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TG</name><description>Trigger generation</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BG</name><description>Brake generation</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CHCTLR1_Output</name><displayName>CHCTLR1</displayName><description>capture/compare mode register 1 (output
          mode)</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><fields><field><name>CC1S</name><description>Capture/Compare 1
              selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>OC1FE</name><description>Output compare 1 fast
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1PE</name><description>Output compare 1 preload
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC1M</name><description>Output compare 1 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC1CE</name><description>Output compare 1 clear
              enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2S</name><description>Capture/Compare 2
              selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OC2FE</name><description>Output compare 2 fast
              enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OC2PE</name><description>Output compare 2 preload
              enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC2M</name><description>Output compare 2 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC2CE</name><description>Output compare 2 clear
              enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CHCTLR1_Input</name><displayName>CHCTLR1</displayName><description>capture/compare mode register 1 (input
          mode)</description><alternateRegister>CHCTLR1_Output</alternateRegister><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><fields><field><name>CC1S</name><description>Capture/Compare 1
              selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>CC2S</name><description>Capture/Compare 2
              selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>IC1PSC</name><description>Input capture 1 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>IC1F</name><description>Input capture 1 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>IC2PSC</name><description>Input capture 2 prescaler</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>IC2F</name><description>Input capture 2 filter</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CHCTLR2_Output</name><displayName>CHCTLR2</displayName><description>capture/compare mode register 2 (output
          mode)</description><addressOffset>0x1C</addressOffset><size>16</size><access>read-write</access><fields><field><name>CC3S</name><description>Capture/Compare 3
              selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>OC3FE</name><description>Output compare 3 fast
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OC3PE</name><description>Output compare 3 preload
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>OC3M</name><description>Output compare 3 mode</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>OC3CE</name><description>Output compare 3 clear
              enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4S</name><description>Capture/Compare 4
              selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OC4FE</name><description>Output compare 4 fast
              enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OC4PE</name><description>Output compare 4 preload
              enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>OC4M</name><description>Output compare 4 mode</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>OC4CE</name><description>Output compare 4 clear
              enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CHCTLR2_Input</name><displayName>CHCTLR2</displayName><description>capture/compare mode register 2 (input
          mode)</description><alternateRegister>CHCTLR2_Output</alternateRegister><addressOffset>0x1C</addressOffset><size>16</size><access>read-write</access><fields><field><name>CC3S</name><description>Capture/Compare 3
              selection</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>CC4S</name><description>Capture/Compare 4
