Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
              selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>IC3PSC</name><description>Input capture 3 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>IC3F</name><description>Input capture 3 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>IC4PSC</name><description>Input capture 4 prescaler</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>IC4F</name><description>Input capture 4 filter</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CCER</name><description>capture/compare enable register</description><addressOffset>0x20</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CC1E</name><description>Capture/Compare 1 output enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1P</name><description>Capture/Compare 1 output Polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1NE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1NP</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2E</name><description>Capture/Compare 2 output enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2P</name><description>Capture/Compare 2 output Polarity</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2NE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2NP</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3E</name><description>Capture/Compare 3 output enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3P</name><description>Capture/Compare 3 output Polarity</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3NE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3NP</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4E</name><description>Capture/Compare 4 output enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4P</name><description>Capture/Compare 3 output Polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4NP</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><description>counter</description><addressOffset>0x24</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CNT</name><description>counter value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><description>prescaler</description><addressOffset>0x28</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ATRLR</name><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ARR</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH1CVR</name><description>capture/compare register 1</description><addressOffset>0x34</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR1</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH2CVR</name><description>capture/compare register 2</description><addressOffset>0x38</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR2</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH3CVR</name><description>capture/compare register 3</description><addressOffset>0x3C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR3</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH4CVR</name><description>capture/compare register 4</description><addressOffset>0x40</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR4</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DMACFGR</name><description>DMA control register</description><addressOffset>0x48</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBA</name><description>DMA base address</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>DBL</name><description>DMA burst length</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DMAADR</name><description>DMA address for full transfer</description><addressOffset>0x4C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DMAR_DMAB</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>RTC</name><description>Real-time clock</description><baseAddress>0x40002800</baseAddress><groupName>RTC</groupName><addressBlock><offset>0x0</offset><size>0x26</size><usage>registers</usage></addressBlock><interrupt><name>RTC</name><description>RTC</description><value>19</value></interrupt><interrupt><name>RTCAlarm</name><description>RTC Alarm through EXTI Line</description><value>57</value></interrupt><registers><register><name>CTLRH</name><description>RTC Control Register High</description><addressOffset>0x0</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SECIE</name><description>Second interrupt Enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ALRIE</name><description>Alarm interrupt Enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>OWIE</name><description>Overflow interrupt Enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLRL</name><description>RTC Control Register Low</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x20</resetValue><fields><field><name>SECF</name><description>Second Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALRF</name><description>Alarm Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OWF</name><description>Overflow Flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RSF</name><description>Registers Synchronized Flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CNF</name><description>Configuration Flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTOFF</name><description>RTC operation OFF</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>PSCRH</name><description>RTC Prescaler Load Register High</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue></register><register><name>PSCRL</name><description>RTC Prescaler Load Register Low</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x8000</resetValue></register><register><name>DIVH</name><description>RTC Prescaler Divider Register High</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>RTC_DIV</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>DIVL</name><description>RTC Prescaler Divider Register Low</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x8000</resetValue><fields><field><name>RTC_DIV</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CNTH</name><description>RTC Counter Register High</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>RTC_CNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CNTL</name><description>RTC Counter Register Low</description><addressOffset>0x1C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>RTC_CNT</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ALRMH</name><description>RTC Alarm Register High</description><addressOffset>0x20</addressOffset><size>16</size><access>read-write</access><resetValue>0xFFFF</resetValue><fields><field><name>RTC_ALRM</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ALRML</name><description>RTC Alarm Register Low</description><addressOffset>0x24</addressOffset><size>16</size><access>read-write</access><resetValue>0xFFFF</resetValue><fields><field><name>RTC_ALRM</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>WWDG</name><description>Window watchdog</description><baseAddress>0x40002C00</baseAddress><groupName>WWDG</groupName><addressBlock><offset>0x0</offset><size>0xC</size><usage>registers</usage></addressBlock><interrupt><name>WWDG</name><description>Window Watchdog</description><value>16</value></interrupt><registers><register><name>CTLR</name><description>Control register (WWDG_CR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x7F</resetValue><fields><field><name>T</name><description>7-bit counter (MSB to LSB)</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>WDGA</name><description>Activation bit</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CFGR</name><description>Configuration register (WWDG_CFR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x7F</resetValue><fields><field><name>W</name><description>7-bit window value</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth><access>read-write</access></field><field><name>WDGTB</name><description>Timer Base</description><bitOffset>7</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>EWI</name><description>Early Wakeup Interrupt</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>STATR</name><description>Status register (WWDG_SR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EWIF</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>IWDG</name><description>Independent watchdog</description><baseAddress>0x40003000</baseAddress><groupName>IWDG</groupName><addressBlock><offset>0x0</offset><size>0x10</size><usage>registers</usage></addressBlock><registers><register><name>CTLR</name><description>Key register (IWDG_CTLR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>KEY</name><description>Key value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth><access>write-only</access></field></fields></register><register><name>PSCR</name><description>Prescaler register (IWDG_PSCR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PR</name><description>Prescaler divider</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field></fields></register><register><name>RLDR</name><description>Reload register (IWDG_RLDR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0xFFF</resetValue><fields><field><name>RL</name><description>Watchdog counter reload value</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-write</access></field></fields></register><register><name>STATR</name><description>Status register (IWDG_SR)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PVU</name><description>Watchdog prescaler value update</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RVU</name><description>Watchdog counter reload value update</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register></registers></peripheral><peripheral><name>USART2</name><description>USART controller 2</description><baseAddress>0x40004400</baseAddress><groupName>USART</groupName><addressBlock><offset>0x0</offset><size>0x1A</size><usage>registers</usage></addressBlock><interrupt><name>USART2</name><description>USART2</description><value>54</value></interrupt><registers><register><name>STATR</name><description>Status register</description><addressOffset>0x0</addressOffset><size>16</size><access>read-write</access><resetValue>0xC0</resetValue><fields><field><name>PE</name><description>Parity error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FE</name><description>Framing error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NE</name><description>Noise error flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ORE</name><description>Overrun error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDLE</name><description>IDLE line detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXNE</name><description>Read data register not empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TC</name><description>Transmission complete</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXE</name><description>Transmit data register empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LBD</name><description>LIN break detection flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTS</name><description>CTS flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DATAR</name><description>Data register</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DR</name><description>Data value</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register><register><name>BRR</name><description>Baud rate register</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DIV_Mantissa</name><description>Mantissa of USARTDIV</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>DIV_Fraction</name><description>Fraction of USARTDIV</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CTLR1</name><description>Control register 1</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SBK</name><description>Send break</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>RWU</name><description>Receiver wakeup</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RE</name><description>Receiver enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TE</name><description>Transmitter enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDLEIE</name><description>IDLE interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RXNE interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transmission complete interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEIE</name><description>TXE interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PEIE</name><description>PE interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PS</name><description>Parity selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>PCE</name><description>Parity control enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>WAKE</name><description>Wakeup method</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>M</name><description>Word length</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>UE</name><description>USART enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OVER8</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR2</name><description>Control register 2</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ADD</name><description>Address of the USART node</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>LBDL</name><description>lin break detection length</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDIE</name><description>LIN break detection interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LBCL</name><description>Last bit clock pulse</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CLKEN</name><description>Clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>STOP bits</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>LINEN</name><description>LIN mode enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR3</name><description>Control register 3</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EIE</name><description>Error interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>IREN</name><description>IrDA mode enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IRLP</name><description>IrDA low-power</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>HDSEL</name><description>Half-duplex selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NACK</name><description>Smartcard NACK enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SCEN</name><description>Smartcard mode enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAR</name><description>DMA enable receiver</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAT</name><description>DMA enable transmitter</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RTSE</name><description>RTS enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSE</name><description>CTS enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSIE</name><description>CTS interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ONEBIT</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>GPR</name><description>Guard time and prescaler register</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>GT</name><description>Guard time value</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral><name>I2C1</name><description>I2C controller 1</description><baseAddress>0x40005400</baseAddress><groupName>I2C</groupName><addressBlock><offset>0x0</offset><size>0x22</size><usage>registers</usage></addressBlock><interrupt><name>I2C1_EV</name><description>I2C1 Event</description><value>47</value></interrupt><interrupt><name>I2C1_ER</name><description>I2C1 Error</description><value>48</value></interrupt><registers><register><name>CTLR1</name><description>Control register 1</description><addressOffset>0x0</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PE</name><description>Peripheral enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBUS</name><description>SMBus mode</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBTYPE</name><description>SMBus type</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ENARP</name><description>ARP enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ENPEC</name><description>PEC enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ENGC</name><description>General call enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>NOSTRETCH</name><description>Clock stretching disable (Slave mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>START</name><description>Start generation</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>Stop generation</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ACK</name><description>Acknowledge enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>POS</name><description>Acknowledge/PEC Position (for data reception)</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>PEC</name><description>Packet error checking</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ALERT</name><description>SMBus alert</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>SWRST</name><description>Software reset</description><bitOffset>15<