Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
/bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR2</name><description>Control register 2</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FREQ</name><description>Peripheral clock frequency</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field><field><name>ITERREN</name><description>Error interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ITEVTEN</name><description>Event interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ITBUFEN</name><description>Buffer interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAEN</name><description>DMA requests enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LAST</name><description>DMA last transfer</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OADDR1</name><description>Own address register 1</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ADD0</name><description>Interface address</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD1</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD2</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD3</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD4</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD5</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD6</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD7</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD8</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD9</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ADDMODE</name><description>Addressing mode (slave mode)</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OADDR2</name><description>Own address register 2</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ENDUAL</name><description>Dual addressing mode enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ADD2</name><description>Interface address</description><bitOffset>1</bitOffset><bitWidth>7</bitWidth></field></fields></register><register><name>DATAR</name><description>Data register</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DR_DATAR</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>STAR1</name><description>Status register 1</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SB</name><description>Start bit (Master mode)</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADDR</name><description>Address sent (master mode)/matched (slave mode)</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BTF</name><description>Byte transfer finished</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ADD10</name><description>10-bit header sent (Master mode)</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>STOPF</name><description>Stop detection (slave mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXNE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXE</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BERR</name><description>Bus error</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ARLO</name><description>Arbitration lost (master mode)</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AF</name><description>Acknowledge failure</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>OVR</name><description>Overrun/Underrun</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PECERR</name><description>PEC Error in reception</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIMEOUT</name><description>Timeout or Tlow error</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SMBALERT</name><description>SMBus alert</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>STAR2</name><description>Status register 2</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>MSL</name><description>Master/slave</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BUSY</name><description>Bus busy</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TRA</name><description>Transmitter/receiver</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>GENCALL</name><description>General call address (Slave mode)</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBDEFAULT</name><description>SMBus device default address (Slave mode)</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>SMBHOST</name><description>SMBus host header (Slave mode)</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>DUALF</name><description>Dual flag (Slave mode)</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PEC</name><description>acket error checking register</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CKCFGR</name><description>Clock control register</description><addressOffset>0x1C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR</name><description>Clock control register in Fast/Standard mode (Master mode)</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field><field><name>DUTY</name><description>Fast mode duty cycle</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FS</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RTR</name><description>Raise time register</description><addressOffset>0x20</addressOffset><size>16</size><access>read-write</access><resetValue>0x2</resetValue><fields><field><name>TRISE</name><description>Maximum rise time in Fast/Standard mode (Master mode)</description><bitOffset>0</bitOffset><bitWidth>6</bitWidth></field></fields></register></registers></peripheral><peripheral><name>CAN1</name><description>bxCAN controller</description><baseAddress>0x40006400</baseAddress><groupName>CAN</groupName><addressBlock><offset>0x0</offset><size>0x320</size><usage>registers</usage></addressBlock><interrupt><name>USB_HP_CAN1_TX</name><description>USB HP and CAN1 TX</description><value>35</value></interrupt><interrupt><name>USB_LP_CAN1_RX0</name><description>USB LP and CAN1RX0</description><value>36</value></interrupt><interrupt><name>CAN1_RX1</name><description>CAN1 RX1</description><value>37</value></interrupt><interrupt><name>CAN1_SCE</name><description>CAN1 SCE</description><value>38</value></interrupt><registers><register><name>CTLR</name><description>CAN Master control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x10002</resetValue><fields><field><name>INRQ</name><description>Initialization request</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLEEP</name><description>Sleep mode request</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXFP</name><description>Transmit FIFO priority</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RFLM</name><description>Receive FIFO locked mode</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>NART</name><description>No automatic retransmission</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>AWUM</name><description>Automatic wakeup mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABOM</name><description>Automatic bus-off management</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TTCM</name><description>Time triggered communication mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RESET</name><description>Software master reset</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DBF</name><description>Debug freeze</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>STATR</name><description>CAN master status register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0xC02</resetValue><fields><field><name>INAK</name><description>Initialization acknowledge</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SLAK</name><description>Sleep acknowledge</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ERRI</name><description>Error interrupt</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUI</name><description>Wakeup interrupt</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLAKI</name><description>Sleep acknowledge interrupt</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXM</name><description>Transmit mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXM</name><description>Receive mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SAMP</name><description>Last sample point</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RX</name><description>Rx signal</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>TSTATR</name><description>CAN transmit status register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x1C000000</resetValue><fields><field><name>RQCP0</name><description>Request completed mailbox0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK0</name><description>Transmission OK of mailbox0</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST0</name><description>Arbitration lost for mailbox0</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR0</name><description>Transmission error of mailbox0</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ0</name><description>Abort request for mailbox0</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP1</name><description>Request completed mailbox1</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK1</name><description>Transmission OK of mailbox1</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST1</name><description>Arbitration lost for mailbox1</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR1</name><description>Transmission error of mailbox1</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ1</name><description>Abort request for mailbox 1</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RQCP2</name><description>Request completed mailbox2</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXOK2</name><description>Transmission OK of mailbox 2</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ALST2</name><description>Arbitration lost for mailbox 2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TERR2</name><description>Transmission error of mailbox 2</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ABRQ2</name><description>Abort request for mailbox 2</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CODE</name><description>Mailbox code</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>TME</name><bitOffset>26</bitOffset><bitWidth>3</bitWidth></field><field><name>LOW</name><bitOffset>29</bitOffset><bitWidth>3</bitWidth></field><field><name>LOW2</name><description>Lowest priority flag for mailbox 2</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW1</name><description>Lowest priority flag for mailbox 1</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LOW0</name><description>Lowest priority flag for mailbox 0</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME2</name><description>Transmit mailbox 2 empty</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME1</name><description>Transmit mailbox 1 empty</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TME0</name><description>Transmit mailbox 0 empty</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>RFIFO0</name><description>CAN receive FIFO 0 register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FMP0</name><description>FIFO 0 message pending</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>FULL0</name><description>FIFO 0 full</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR0</name><description>FIFO 0 overrun</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RFOM0</name><description>Release FIFO 0 output mailbox</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>RFIFO1</name><description>CAN receive FIFO 1 register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FMP1</name><description>FIFO 1 message pending</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>FULL1</name><description>FIFO 1 full</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVR1</name><description>FIFO 1 overrun</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RFOM1</name><description>Release FIFO 1 output mailbox</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>INTENR</name><description>CAN interrupt enable register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TMEIE</name><description>Transmit mailbox empty interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMPIE0</name><description>FIFO message pending interrupt enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FFIE0</name><description>FIFO full interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVIE0</name><description>FIFO overrun interrupt enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FMPIE1</name><description>FIFO message pending interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FFIE1</name><description>FIFO full interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>FOVIE1</name><description>FIFO overrun interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EWGIE</name><description>Error warning interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EPVIE</name><description>Error passive interrupt enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BOFIE</name><description>Bus-off interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LECIE</name><description>Last error code interrupt enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WKUIE</name><description>Wakeup interrupt enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SLKIE</name><description>Sleep interrupt enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>ERRSR</name><description>CAN error status register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EWGF</name><description>Error warning flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EPVF</name><description>Error passive flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BOFF</name><description>Bus-off flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LEC</name><description>Last error code</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>TEC</name><description>Least significant byte of the 9-bit transmit error counter</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>REC</name><description>Receive error counter</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register><register><name>BTIMR</name><description>CAN bit timing register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x1230000</resetValue><fields><field><name>BRP</name><description>Baud rate prescaler</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth><access>read-write</access></field><field><name>TS1</name><description>Time segment 1</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>TS2</name><description>Time segment 2</description><bitOffset>20</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>SJW</name><description>Resynchronization jump width</description><bitOffset>24</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>LBKM</name><description>Loop back mode (debug)</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SILM</name><description>Silent mode (debug)</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><cluster><name>TxMailBox%s</name><dim>3</dim><dimIncrement>0x10</dimIncrement><addressOffset>0x180</addressOffset><register><name>TXMIR</name><description>CAN TX mailbox identifier register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>STID</name><description>Standard identifier</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth><access>read-write</access></field><field><name>EXID</name><description>extended identifier</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth><access>read-write</access></field><field><name>IDE</name><description>Identifier extension</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTR</name><description>Remote transmission request</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXRQ</name><description>Transmit mailbox request</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>TXMDTR</name><description>CAN mailbox data length control and time stamp register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TIME</name><description>Message time stamp</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-write</access></field><field><name>TGT</name><description>Transmit global time</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>DLC</name><description>Data length code</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field></fields></register><register><name>TXMDLR</name><description>CAN mailbox data low register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DATA3</name><description>Data byte 3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DATA2</name><description>Data byte 2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DATA1</name><