Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
description>Data byte 1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DATA0</name><description>Data byte 0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register><register><name>TXMDHR</name><description>CAN mailbox data high register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DATA7</name><description>Data byte 7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DATA6</name><description>Data byte 6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DATA5</name><description>Data byte 5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field><field><name>DATA4</name><description>Data byte 4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-write</access></field></fields></register></cluster><cluster><name>FIFOMailBox%s</name><dim>2</dim><dimIncrement>0x10</dimIncrement><addressOffset>0x1B0</addressOffset><register><name>RXMIR</name><description>CAN receive FIFO mailbox identifier register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>STID</name><description>Standard identifier</description><bitOffset>21</bitOffset><bitWidth>11</bitWidth><access>read-only</access></field><field><name>EXID</name><description>extended identifier</description><bitOffset>3</bitOffset><bitWidth>18</bitWidth><access>read-only</access></field><field><name>IDE</name><description>Identifier extension</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RTR</name><description>Remote transmission request</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>RXMDTR</name><description>CAN receive FIFO mailbox data length control and time stamp 
