Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
          register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TIME</name><description>Message time stamp</description><bitOffset>16</bitOffset><bitWidth>16</bitWidth><access>read-only</access></field><field><name>FMI</name><description>Filter match index</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DLC</name><description>Data length code</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field></fields></register><register><name>RXMDLR</name><description>CAN receive FIFO mailbox data low register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DATA3</name><description>Data Byte 3</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DATA2</name><description>Data Byte 2</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DATA1</name><description>Data Byte 1</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DATA0</name><description>Data Byte 0</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register><register><name>RXMDHR</name><description>CAN receive FIFO mailbox data high register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DATA7</name><description>DATA7</description><bitOffset>24</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DATA6</name><description>DATA6</description><bitOffset>16</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DATA5</name><description>DATA5</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>DATA4</name><description>DATA4</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field></fields></register></cluster><register><name>FCTLR</name><description>CAN filter master register</description><addressOffset>0x200</addressOffset><size>32</size><access>read-write</access><resetValue>0x2A1C0E01</resetValue><fields><field><name>FINIT</name><description>Filter init mode</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>FMCFGR</name><description>CAN filter mode register</description><addressOffset>0x204</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FBM</name><bitOffset>0</bitOffset><bitWidth>28</bitWidth></field></fields></register><register><name>FSCFGR</name><description>CAN filter scale register</description><addressOffset>0x20C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FSC</name><bitOffset>0</bitOffset><bitWidth>28</bitWidth></field></fields></register><register><name>FAFIFOR</name><description>CAN filter FIFO assignment register</description><addressOffset>0x214</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FFA</name><bitOffset>0</bitOffset><bitWidth>28</bitWidth></field></fields></register><register><name>FWR</name><description>CAN filter activation register</description><addressOffset>0x21C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FACT</name><bitOffset>0</bitOffset><bitWidth>28</bitWidth></field></fields></register><cluster><name>FilterRegister%s</name><dim>28</dim><dimIncrement>0x8</dimIncrement><addressOffset>0x240</addressOffset><register><name>FR1</name><description>Filter bank 0 register 1</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FR2</name><description>Filter bank 0 register 2</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FB0</name><description>Filter bits</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>FB1</name><description>Filter bits</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>FB2</name><description>Filter bits</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FB3</name><description>Filter bits</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FB4</name><description>Filter bits</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>FB5</name><description>Filter bits</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>FB6</name><description>Filter bits</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>FB7</name><description>Filter bits</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>FB8</name><description>Filter bits</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>FB9</name><description>Filter bits</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>FB10</name><description>Filter bits</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>FB11</name><description>Filter bits</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>FB12</name><description>Filter bits</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FB13</name><description>Filter bits</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>FB14</name><description>Filter bits</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>FB15</name><description>Filter bits</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>FB16</name><description>Filter bits</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>FB17</name><description>Filter bits</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>FB18</name><description>Filter bits</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>FB19</name><description>Filter bits</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>FB20</name><description>Filter bits</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>FB21</name><description>Filter bits</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>FB22</name><description>Filter bits</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>FB23</name><description>Filter bits</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>FB24</name><description>Filter bits</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>FB25</name><description>Filter bits</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>FB26</name><description>Filter bits</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>FB27</name><description>Filter bits</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>FB28</name><description>Filter bits</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>FB29</name><description>Filter bits</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>FB30</name><description>Filter bits</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>FB31</name><description>Filter bits</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register></cluster></registers></peripheral><peripheral><name>BKP</name><description>Backup register block</description><baseAddress>0x40006C00</baseAddress><groupName>BKP</groupName><addressBlock><offset>0x0</offset><size>0xBE</size><usage>registers</usage></addressBlock><interrupt><name>TAMPER</name><description>TAMPER</description><value>18</value></interrupt><interrupt><name>RTC</name><description>RTC</description><value>19</value></interrupt><interrupt><name>RTCAlarm</name><description>RTC Alarm through EXTI Line</description><value>57</value></interrupt><registers><register><name>DATAR1</name><description>Backup data register (BKP_DR)</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR2</name><description>Backup data register (BKP_DR)</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR3</name><description>Backup data register (BKP_DR)</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR4</name><description>Backup data register (BKP_DR)</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR5</name><description>Backup data register (BKP_DR)</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR6</name><description>Backup data register (BKP_DR)</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR7</name><description>Backup data register (BKP_DR)</description><addressOffset>0x1C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR8</name><description>Backup data register (BKP_DR)</description><addressOffset>0x20</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR9</name><description>Backup data register (BKP_DR)</description><addressOffset>0x24</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR10</name><description>Backup data register (BKP_DR)</description><addressOffset>0x28</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>OCTLR</name><description>RTC clock calibration register (BKP_OCTLR)</description><addressOffset>0x2C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CAL</name><description>Calibration value</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field><field><name>CCO</name><description>Calibration Clock Output</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ASOE</name><description>Alarm or second output enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ASOS</name><description>Alarm or second output selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TPCTLR</name><description>Backup control register (BKP_TPCTLR)</description><addressOffset>0x30</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TPE</name><description>Tamper pin enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TPAL</name><description>Tamper pin active level</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>TPCSR</name><description>BKP_TPCSR control/status register (BKP_CSR)</description><addressOffset>0x34</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CTE</name><description>Clear Tamper event</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CTI</name><description>Clear Tamper Interrupt</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>TPIE</name><description>Tamper Pin interrupt enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TEF</name><description>Tamper Event Flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TIF</name><description>Tamper Interrupt Flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DATAR11</name><description>Backup data register (BKP_DR)</description><addressOffset>0x40</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR12</name><description>Backup data register (BKP_DR)</description><addressOffset>0x44</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR13</name><description>Backup data register (BKP_DR)</description><addressOffset>0x48</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR14</name><description>Backup data register (BKP_DR)</description><addressOffset>0x4C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR15</name><description>Backup data register (BKP_DR)</description><addressOffset>0x50</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR16</name><description>Backup data register (BKP_DR)</description><addressOffset>0x54</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR17</name><description>Backup data register (BKP_DR)</description><addressOffset>0x58</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR18</name><description>Backup data register (BKP_DR)</description><addressOffset>0x5C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR19</name><description>Backup data register (BKP_DR)</description><addressOffset>0x60</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR20</name><description>Backup data register (BKP_DR)</description><addressOffset>0x64</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR21</name><description>Backup data register (BKP_DR)</description><addressOffset>0x68</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR22</name><description>Backup data register (BKP_DR)</description><addressOffset>0x6C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR23</name><description>Backup data register (BKP_DR)</description><addressOffset>0x70</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR24</name><description>Backup data register (BKP_DR)</description><addressOffset>0x74</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR25</name><description>Backup data register (BKP_DR)</description><addressOffset>0x78</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR26</name><description>Backup data register (BKP_DR)</description><addressOffset>0x7C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR27</name><description>Backup data register (BKP_DR)</description><addressOffset>0x80</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR28</name><description>Backup data register (BKP_DR)</description><addressOffset>0x84</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR29</name><description>Backup data register (BKP_DR)</description><addressOffset>0x88</addressOffset><size>16</size><access>read-write</acces