Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
s><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR30</name><description>Backup data register (BKP_DR)</description><addressOffset>0x8C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR31</name><description>Backup data register (BKP_DR)</description><addressOffset>0x90</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR32</name><description>Backup data register (BKP_DR)</description><addressOffset>0x94</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR33</name><description>Backup data register (BKP_DR)</description><addressOffset>0x98</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR34</name><description>Backup data register (BKP_DR)</description><addressOffset>0x9C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR35</name><description>Backup data register (BKP_DR)</description><addressOffset>0xA0</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR36</name><description>Backup data register (BKP_DR)</description><addressOffset>0xA4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR37</name><description>Backup data register (BKP_DR)</description><addressOffset>0xA8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR38</name><description>Backup data register (BKP_DR)</description><addressOffset>0xAC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR39</name><description>Backup data register (BKP_DR)</description><addressOffset>0xB0</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR40</name><description>Backup data register (BKP_DR)</description><addressOffset>0xB4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR41</name><description>Backup data register (BKP_DR)</description><addressOffset>0xB8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>DATAR42</name><description>Backup data register (BKP_DR)</description><addressOffset>0xBC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>D</name><description>Backup data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>PWR</name><description>Power control block</description><baseAddress>0x40007000</baseAddress><groupName>PWR</groupName><addressBlock><offset>0x0</offset><size>0x8</size><usage>registers</usage></addressBlock><interrupt><name>PVD</name><description>PVD through EXTI Line detect</description><value>17</value></interrupt><registers><register><name>CTLR</name><description>Power control register (PWR_CTRL)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LPDS</name><description>Low Power Deep Sleep</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PDDS</name><description>Power Down Deep Sleep</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CWUF</name><description>Clear Wake-up Flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CSBF</name><description>Clear STANDBY Flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PVDE</name><description>Power Voltage Detector Enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS</name><description>PVD Level Selection</description><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>PLS_2V3</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS_2V4</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS_2V5</name><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>PLS_2V6</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PLS_2V8</name><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PLS_2V9</name><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>DBP</name><description>Disable Backup Domain write protection</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CSR</name><description>Power control register (PWR_CSR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>WUF</name><description>Wake-Up Flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SBF</name><description>STANDBY Flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PVDO</name><description>PVD Output</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>EWUP</name><description>Enable WKUP pin</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>AFIO</name><description>Alternate-function and pin remap controller</description><baseAddress>0x40010000</baseAddress><groupName>AFIO</groupName><addressBlock><offset>0x0</offset><size>0x20</size><usage>registers</usage></addressBlock><registers><register><name>ECR</name><description>Event Control Register (AFIO_ECR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PIN</name><description>Pin selection</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>PIN_PX1</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PIN_PX2</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>PIN_PX3</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>PIN_PX4</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>PIN_PX6</name><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>PIN_PX7</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>PIN_PX8</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>PIN_PX12</name><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>PIN_PX14</name><bitOffset>1</bitOffset><bitWidth>3</bitWidth></field><field><name>PIN_PX15</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>PORT</name><description>Port selection</description><bitOffset>4</bitOffset><bitWidth>3</bitWidth></field><field><name>PORT_PB</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>PORT_PC</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PORT_PD</name><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>PORT_PE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>EVOE</name><description>Event Output Enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_TIM1_REMAP</name><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_TIM1_REMAP_FULLREMAP</name><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_TIM2_REMAP</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_TIM2_REMAP_PARTIALREMAP1</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_TIM2_REMAP_PARTIALREMAP2</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_TIM2_REMAP_FULLREMAP</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_TIM3_REMAP</name><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_TIM3_REMAP_PARTIALREMAP</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_TIM3_REMAP_FULLREMAP</name><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_TIM4_REMAP</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_CAN_REMAP</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_CAN_REMAP_REMAP2</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_CAN_REMAP_REMAP3</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field><field><name>PCFR1_PD01_REMAP</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_TIM5CH4_IREMAP</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_ADC1_ETRGINJ_REMAP</name><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_ADC1_ETRGREG_REMAP</name><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_ADC2_ETRGINJ_REMAP</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_ADC2_ETRGREG_REMAP</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_SWJ_CFG</name><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>PCFR1_SWJ_CFG_NOJNTRST</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_SWJ_CFG_JTAGDISABLE</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>PCFR1_SWJ_CFG_DISABLE</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>PCFR1</name><description>AF remap and debug I/O configuration
          register (AFIO_PCFR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><fields><field><name>SPI1RM</name><description>SPI1 remapping</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>I2C1RM</name><description>I2C1 remapping</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART1RM</name><description>USART1 remapping</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART2RM</name><description>USART2 remapping</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>USART3RM</name><description>USART3 remapping</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TIM1RM</name><description>TIM1 remapping</description><bitOffset>6</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TIM2RM</name><description>TIM2 remapping</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TIM3RM</name><description>TIM3 remapping</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>TIM4RM</name><description>TIM4 remapping</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN1RM</name><description>CAN1 remapping</description><bitOffset>13</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>PD01RM</name><description>Port D0/Port D1 mapping on
              OSCIN/OSCOUT</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM5CH4RM</name><description>TIM5 channel4 internal remap</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC1_ETRGINJ_RM</name><description>ADC 1 External trigger injected conversion remapping</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC1_ETRGREG_RM</name><description>ADC 1 external trigger regular conversion remapping</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC2_ETRGINJ_RM</name><description>ADC 2 External trigger injected conversion remapping</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ADC2_ETRGREG_RM</name><description>ADC 2 external trigger regular conversion remapping</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>ETHRM</name><description>Ethernet remapping</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CAN2RM</name><description>CAN2 remapping</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MII_RMII_SEL</name><description>MII_RMII_SEL</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SWCFG</name><description>Serial wire JTAG
