Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
              configuration</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth><access>write-only</access></field><field><name>SPI3_RM</name><description>SPI3 remapping</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TIM2ITRA_RM</name><description>TIM2 internally triggers 1 remapping</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PTP_PPSP_RM</name><description>Ethernet PTP_PPS remapping</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>EXTICR1</name><description>External interrupt configuration register 1 (AFIO_EXTICR1)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EXTI0</name><description>EXTI0 configuration</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI1</name><description>EXTI1 configuration</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI2</name><description>EXTI2 configuration</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI3</name><description>EXTI3 configuration</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI0_PB</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI0_PC</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI0_PD</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI0_PE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI0_PG</name><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI1_PB</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI1_PC</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI1_PD</name><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI1_PE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI1_PG</name><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI2_PB</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI2_PC</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI2_PD</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI2_PE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI2_PG</name><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI3_PB</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI3_PC</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI3_PD</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI3_PE</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI3_PG</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>EXTICR2</name><description>External interrupt configuration register 2 (AFIO_EXTICR2)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EXTI4</name><description>EXTI4 configuration</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI5</name><description>EXTI5 configuration</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI6</name><description>EXTI6 configuration</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI7</name><description>EXTI7 configuration</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI4_PB</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI4_PC</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI4_PD</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI4_PE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI4_PG</name><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI5_PB</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI5_PC</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI5_PD</name><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI5_PE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI5_PG</name><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI6_PB</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI6_PC</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI6_PD</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI6_PE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI6_PG</name><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI7_PB</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI7_PC</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI7_PD</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI7_PE</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI7_PG</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>EXTICR3</name><description>External interrupt configuration register 3 (AFIO_EXTICR3)</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EXTI8</name><description>EXTI8 configuration</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI9</name><description>EXTI9 configuration</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI10</name><description>EXTI10 configuration</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI11</name><description>EXTI11 configuration</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI8_PB</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI8_PC</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI8_PD</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI8_PE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI8_PG</name><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI9_PB</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI9_PC</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI9_PD</name><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI9_PE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI9_PG</name><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI10_PB</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI10_PC</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI10_PD</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI10_PE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI10_PG</name><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI11_PB</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI11_PC</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI11_PD</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI11_PE</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI11_PG</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>EXTICR4</name><description>External interrupt configuration register 4 (AFIO_EXTICR4)</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EXTI12</name><description>EXTI12 configuration</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI13</name><description>EXTI13 configuration</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI14</name><description>EXTI14 configuration</description><bitOffset>8</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI15</name><description>EXTI15 configuration</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field><field><name>EXTI12_PB</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI12_PC</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI12_PD</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI12_PE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI12_PG</name><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI13_PB</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI13_PC</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI13_PD</name><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI13_PE</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI13_PG</name><bitOffset>5</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI14_PB</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI14_PC</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI14_PD</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI14_PE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI14_PG</name><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI15_PB</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI15_PC</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI15_PD</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>EXTI15_PE</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTI15_PG</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>PCFR2</name><description>AF remap and debug I/O configuration register (AFIO_PCFR2)</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>USART4_RM</name><description>USART4 remap</description><bitOffset>26</bitOffset><bitWidth>2</bitWidth></field></fields></register></registers></peripheral><peripheral><name>EXTI</name><description>External interrupt/event controller</description><baseAddress>0x40010400</baseAddress><groupName>EXTI</groupName><addressBlock><offset>0x0</offset><size>0x18</size><usage>registers</usage></addressBlock><interrupt><name>EXTI0</name><description>EXTI Line 0</description><value>22</value></interrupt><interrupt><name>EXTI1</name><description>EXTI Line 1</description><value>23</value></interrupt><interrupt><name>EXTI2</name><description>EXTI Line 2</description><value>24</value></interrupt><interrupt><name>EXTI3</name><description>EXTI Line 3</description><value>25</value></interrupt><interrupt><name>EXTI4</name><description>EXTI Line 4</description><value>26</value></interrupt><interrupt><name>EXTI9_5</name><description>EXTI Line 9..5</description><value>39</value></interrupt><interrupt><name>EXTI15_10</name><description>EXTI Line 15..10</description><value>56</value></interrupt><registers><register><name>INTENR</name><description>Interrupt mask register (EXTI_INTENR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>MR0</name><description>Interrupt Mask on line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR1</name><description>Interrupt Mask on line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR2</name><description>Interrupt Mask on line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR3</name><description>Interrupt Mask on line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>MR4</name><description>Interrupt Mask on line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>MR5</name><description>Interrupt Mask on line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>MR6</name><description>Interrupt Mask on line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MR7</name><description>Interrupt Mask on line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>MR8</name><description>Interrupt Mask on line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>MR9</name><description>Interrupt Mask on line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>MR10</name><description>Interrupt Mask on line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>MR11</name><description>Interrupt Mask on line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>MR12</name><description>Interrupt Mask on line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MR13</name><description>Interrupt Mask on line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>MR14</name><description>Interrupt Mask on line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>MR15</name><description>Interrupt Mask on line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MR16</name><description>Interrupt Mask on line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>MR17</name><description>Interrupt Mask on line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>MR18</name><description>Interrupt Mask on line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>MR19</name><description>Interrupt Mask on line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>EVENR</name><description>Event mask register (EXTI_EVENR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>MR0</name><description>Event Mask on line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>MR1</name><description>Event Mask on line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MR2</name><description>Event Mask on line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>MR3</name><description>Event Mask on line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>MR4</name><description>Event Mask on line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>MR5</name><description>Event Mask on line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>MR6</name><description>Event Mask on line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MR7</name><description>Event Mask on line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>MR8</name><description>Event Mask on line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>MR9</name><description>Event Mask on line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>MR10</name><description>Event Mask on line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>MR11</name><description>Event Mask on line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>MR12</name><description>Event Mask on line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>MR13</name><description>Event Mask on line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>MR14</name><description>Event Mask on line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>MR15</name><description>Event Mask on line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>MR16</name><description>Event Mask on line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>MR17</name><description>Event Mask on line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>MR18</name><description>Event Mask on line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>MR19</name><description>Event Mask on line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>RTENR</name><description>Rising Trigger selection register (EXTI_RTENR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TR0</name><description>Rising trigger event configuration of line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR1</name><description>Rising trigger event configuration of line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TR2</name><description>Rising trigger event configuration of line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TR3</name><description>Rising trigger event configuration of line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TR4</name><description>Rising trigger event configuration of line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TR5</name><description>Rising trigger event configuration of line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TR6</name><description>Rising trigger event configuration of line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TR7</name><description>Rising trigger event configuration of line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TR8</name><description>Rising trigger event configuration of line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TR9</name><description>Rising trigger event configuration of line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TR10</name><description>Rising trigger event configuration of line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TR11</name><description>Rising trigger event configuration of line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TR12</name><description>Rising trigger event configuration of line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TR13</name><description>Rising trigger event configuration of line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>TR14</name><description>Rising trigger event configuration of line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TR15</name><description>Rising trigger event configuration of line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TR16</name><description>Rising trigger event configuration of line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TR17</name><description>Rising trigger event configuration of line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TR18</name><description>Rising trigger event configuration of line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TR19</name><description>Rising trigger event configuration of line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>FTENR</name><description>Falling Trigger selection register (EXTI_FTENR)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TR0</name><description>Falling trigger event configuration of line 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TR1</name><description>Falling trigger event configuration of line 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TR2</name><description>Falling trigger event configuration of line 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TR3</name><description>Falling trigger event configuration of line 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>TR4</name><description>Falling trigger event configuration of line 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TR5</name><description>Falling trigger event configuration of line 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TR6</name><description>Falling trigger event configuration of line 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TR7</name><description>Falling trigger event configuration of line 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>TR8</name><description>Falling trigger event configuration of line 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TR9</name><description>Falling trigger event configuration of line 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>TR10</name><description>Falling trigger event configuration of line 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TR11</name><description>Falling trigger event configuration of line 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>TR12</name><description>Falling trigger event configuration of line 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TR13</name><description>Falling trigger event configuration of line 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>TR14</name><description>Falling trigger event configuration of line 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TR15</name><description>Falling trigger event configuration of line 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>TR16</name><description>Falling trigger event configuration of line 16</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TR17</name><description>Falling trigger event configuration of line 17</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>TR18</name><description>Falling trigger event configuration of line 18</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TR19</name><description>Falling trigger event configuration of line 19</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SWIEVR</name><description>Software interrupt event register (EXTI_SWIEVR)</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SWIEVR0</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SWIEVR1</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SWIEVR2