Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
tWidth>1</bitWidth></field><field><name>BR2</name><description>Reset bit 2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Reset bit 3</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Reset bit 4</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Reset bit 5</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Reset bit 6</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Reset bit 7</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Reset bit 8</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Reset bit 9</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Reset bit 10</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Reset bit 11</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Reset bit 12</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Reset bit 13</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Reset bit 14</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Reset bit 15</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BCR</name><description>Port bit reset register (GPIOn_BCR)</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>BR0</name><description>Reset bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Reset bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Reset bit 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Reset bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Reset bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Reset bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Reset bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Reset bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Reset bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Reset bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Reset bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Reset bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Reset bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Reset bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Reset bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Reset bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>LCKR</name><description>Port configuration lock register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LCK0</name><description>Port A Lock bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK1</name><description>Port A Lock bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK2</name><description>Port A Lock bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK3</name><description>Port A Lock bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK4</name><description>Port A Lock bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK5</name><description>Port A Lock bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK6</name><description>Port A Lock bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK7</name><description>Port A Lock bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK8</name><description>Port A Lock bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK9</name><description>Port A Lock bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK10</name><description>Port A Lock bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK11</name><description>Port A Lock bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK12</name><description>Port A Lock bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK13</name><description>Port A Lock bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK14</name><description>Port A Lock bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK15</name><description>Port A Lock bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LCKK</name><description>Lock key</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>GPIOC</name><description>GPIO port C</description><baseAddress>0x40011000</baseAddress><groupName>GPIO</groupName><addressBlock><offset>0x0</offset><size>0x1C</size><usage>registers</usage></addressBlock><registers><register><name>CFGLR</name><description>Port configuration register low (GPIOn_CFGLR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x44444444</resetValue></register><register><name>CFGHR</name><description>Port configuration register high (GPIOn_CFGHR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x44444444</resetValue></register><register><name>INDR</name><description>Port input data register (GPIOn_INDR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>IDR0</name><description>Port input data</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR1</name><description>Port input data</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR2</name><description>Port input data</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR3</name><description>Port input data</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR4</name><description>Port input data</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR5</name><description>Port input data</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR6</name><description>Port input data</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR7</name><description>Port input data</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR8</name><description>Port input data</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR9</name><description>Port input data</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR10</name><description>Port input data</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR11</name><description>Port input data</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR12</name><description>Port input data</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR13</name><description>Port input data</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR14</name><description>Port input data</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR15</name><description>Port input data</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OUTDR</name><description>Port output data register (GPIOn_OUTDR)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ODR0</name><description>Port output data</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR1</name><description>Port output data</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR2</name><description>Port output data</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR3</name><description>Port output data</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR4</name><description>Port output data</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR5</name><description>Port output data</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR6</name><description>Port output data</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR7</name><description>Port output data</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR8</name><description>Port output data</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR9</name><description>Port output data</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR10</name><description>Port output data</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR11</name><description>Port output data</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR12</name><description>Port output data</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR13</name><description>Port output data</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR14</name><description>Port output data</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR15</name><description>Port output data</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BSHR</name><description>Port bit set/reset register (GPIOn_BSHR)</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>BS0</name><description>Set bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BS1</name><description>Set bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BS2</name><description>Set bit 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BS3</name><description>Set bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BS4</name><description>Set bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BS5</name><description>Set bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BS6</name><description>Set bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BS7</name><description>Set bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BS8</name><description>Set bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BS9</name><description>Set bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BS10</name><description>Set bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BS11</name><description>Set bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BS12</name><description>Set bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BS13</name><description>Set bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BS14</name><description>Set bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BS15</name><description>Set bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BR0</name><description>Reset bit 0</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Reset bit 1</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Reset bit 2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Reset bit 3</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Reset bit 4</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Reset bit 5</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Reset bit 6</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Reset bit 7</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Reset bit 8</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Reset bit 9</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Reset bit 10</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Reset bit 11</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Reset bit 12</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Reset bit 13</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Reset bit 14</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Reset bit 15</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BCR</name><description>Port bit reset register (GPIOn_BCR)</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>BR0</name><description>Reset bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Reset bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Reset bit 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Reset bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Reset bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Reset bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Reset bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Reset bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Reset bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Reset bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Reset bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Reset bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Reset bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Reset bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Reset bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Reset bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>LCKR</name><description>Port configuration lock register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LCK0</name><description>Port A Lock bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK1</name><description>Port A Lock bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK2</name><description>Port A Lock bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK3</name><description>Port A Lock bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK4</name><description>Port A Lock bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK5</name><description>Port A Lock bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK6</name><description>Port A Lock bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK7</name><description>Port A Lock bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK8</name><description>Port A Lock bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK9</name><description>Port A Lock bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK10</name><description>Port A Lock bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK11</name><description>Port A Lock bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK12</name><description>Port A Lock bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK13</name><description>Port A Lock bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK14</name><description>Port A Lock bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK15</name><description>Port A Lock bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LCKK</name><description>Lock key</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>GPIOD</name><description>GPIO port D</description><baseAddress>0x40011400</baseAddress><groupName>GPIO</groupName><addressBlock><offset>0x0</offset><size>0x1C</size><usage>registers</usage></addressBlock><registers><register><name>CFGLR</name><description>Port configuration register low (GPIOn_CFGLR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x44444444</resetValue></register><register><name>CFGHR</name><description>Port configuration register high (GPIOn_CFGHR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x44444444</resetValue></register><register><name>INDR</name><description>Port input data register (GPIOn_INDR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>IDR0</name><description>Port input data</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR1</name><description>Port input data</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR2</name><description>Port input data</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR3</name><description>Port input data</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR4</name><description>Port input data</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR5</name><description>Port input data</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR6</name><description>Port input data</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR7</name><description>Port input data</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR8</name><description>Port input data</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR9</name><description>Port input data</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR10</name><description>Port input data</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR11</name><description>Port input data</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR12</name><description>Port input data</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR13</name><description>Port input data</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR14</name><description>Port input data</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>IDR15</name><description>Port input data</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OUTDR</name><description>Port output data register (GPIOn_OUTDR)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ODR0</name><description>Port output data</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR1</name><description>Port output data</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR2</name><description>Port output data</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR3</name><description>Port output data</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR4</name><description>Port output data</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR5</name><description>Port output data</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR6</name><description>Port output data</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR7</name><description>Port output data</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR8</name><description>Port output data</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR9</name><description>Port output data</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR10</name><description>Port output data</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR11</name><description>Port output data</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR12</name><description>Port output data</description><bitOffset>1