Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
2</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR13</name><description>Port output data</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR14</name><description>Port output data</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ODR15</name><description>Port output data</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BSHR</name><description>Port bit set/reset register (GPIOn_BSHR)</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>BS0</name><description>Set bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BS1</name><description>Set bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BS2</name><description>Set bit 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BS3</name><description>Set bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BS4</name><description>Set bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BS5</name><description>Set bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BS6</name><description>Set bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BS7</name><description>Set bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BS8</name><description>Set bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BS9</name><description>Set bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BS10</name><description>Set bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BS11</name><description>Set bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BS12</name><description>Set bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BS13</name><description>Set bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BS14</name><description>Set bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BS15</name><description>Set bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>BR0</name><description>Reset bit 0</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Reset bit 1</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Reset bit 2</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Reset bit 3</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Reset bit 4</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Reset bit 5</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Reset bit 6</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Reset bit 7</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Reset bit 8</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Reset bit 9</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Reset bit 10</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Reset bit 11</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Reset bit 12</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Reset bit 13</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Reset bit 14</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Reset bit 15</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BCR</name><description>Port bit reset register (GPIOn_BCR)</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>BR0</name><description>Reset bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>BR1</name><description>Reset bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>BR2</name><description>Reset bit 1</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BR3</name><description>Reset bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>BR4</name><description>Reset bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>BR5</name><description>Reset bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>BR6</name><description>Reset bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>BR7</name><description>Reset bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>BR8</name><description>Reset bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>BR9</name><description>Reset bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>BR10</name><description>Reset bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>BR11</name><description>Reset bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BR12</name><description>Reset bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BR13</name><description>Reset bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BR14</name><description>Reset bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BR15</name><description>Reset bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>LCKR</name><description>Port configuration lock register</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LCK0</name><description>Port A Lock bit 0</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK1</name><description>Port A Lock bit 1</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK2</name><description>Port A Lock bit 2</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK3</name><description>Port A Lock bit 3</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK4</name><description>Port A Lock bit 4</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK5</name><description>Port A Lock bit 5</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK6</name><description>Port A Lock bit 6</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK7</name><description>Port A Lock bit 7</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK8</name><description>Port A Lock bit 8</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK9</name><description>Port A Lock bit 9</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK10</name><description>Port A Lock bit 10</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK11</name><description>Port A Lock bit 11</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK12</name><description>Port A Lock bit 12</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK13</name><description>Port A Lock bit 13</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK14</name><description>Port A Lock bit 14</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>LCK15</name><description>Port A Lock bit 15</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>LCKK</name><description>Lock key</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>ADC1</name><description>12-bit ADC unit 1 / TouchKey block</description><baseAddress>0x40012400</baseAddress><groupName>ADC</groupName><addressBlock><offset>0x0</offset><size>0x50</size><usage>registers</usage></addressBlock><interrupt><name>ADC1_2</name><description>ADC1_2</description><value>34</value></interrupt><registers><register><name>STATR</name><description>status register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>AWD</name><description>Analog watchdog flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC</name><description>Regular channel end of conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOC</name><description>Injected channel end of conversion</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>JSTRT</name><description>Injected channel start flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>STRT</name><description>Regular channel start flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR1</name><description>control register 1/TKEY_V_CTLR</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>AWDCH</name><description>Analog watchdog channel select bits</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>EOCIE</name><description>Interrupt enable for EOC</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDIE</name><description>Analog watchdog interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOCIE</name><description>Interrupt enable for injected channels</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SCAN</name><description>Scan mode enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDSGL</name><description>Enable the watchdog on a single channel in scan mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>JAUTO</name><description>Automatic injected group conversion</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>DISCEN</name><description>Discontinuous mode on regular channels</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>JDISCEN</name><description>Discontinuous mode on injected channels</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DISCNUM</name><description>Discontinuous mode channel count</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth></field><field><name>DUALMOD</name><description>Dual mode selection</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>JAWDEN</name><description>Analog watchdog enable on injected channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDEN</name><description>Analog watchdog enable on regular channels</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR2</name><description>control register 2</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ADON</name><description>A/D converter ON / OFF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CONT</name><description>Continuous conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CAL</name><description>A/D calibration</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RSTCAL</name><description>Reset calibration</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA</name><description>Direct memory access mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ALIGN</name><description>Data alignment</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>JEXTSEL</name><description>External event select for injected group</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>JEXTTRIG</name><description>External trigger conversion mode for injected channels</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTSEL</name><description>External event select for regular group</description><bitOffset>17</bitOffset><bitWidth>3</bitWidth></field><field><name>EXTTRIG</name><description>External trigger conversion mode for regular channels</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>JSWSTART</name><description>Start conversion of injected channels</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>SWSTART</name><description>Start conversion of regular channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSVREFE</name><description>Temperature sensor and VREFINT enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SAMPTR1</name><description>sample time register 1</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><fields><field><name>SMP10</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP11</name><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP12</name><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP13</name><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP14</name><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP15</name><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP16</name><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP17</name><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP10_TKCG10</name><description>Channel 10 sample time
              selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP11_TKCG11</name><description>Channel 11 sample time
              selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP12_TKCG12</name><description>Channel 12 sample time
              selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP13_TKCG13</name><description>Channel 13 sample time
              selection</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP14_TKCG14</name><description>Channel 14 sample time
              selection</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP15_TKCG15</name><description>Channel 15 sample time
              selection</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP16_TKCG16</name><description>Channel 16 sample time
              selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP17_TKCG17</name><description>Channel 17 sample time
              selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>SAMPTR2</name><description>sample time register 2</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><fields><field><name>SMP0</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP1</name><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP2</name><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP3</name><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP4</name><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP5</name><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP6</name><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP7</name><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP8</name><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP9</name><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP0_TKCG0</name><description>Channel 0 sample time
              selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP1_TKCG1</name><description>Channel 1 sample time
              selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP2_TKCG2</name><description>Channel 2 sample time
              selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP3_TKCG3</name><description>Channel 3 sample time
              selection</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP4_TKCG4</name><description>Channel 4 sample time
              selection</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP5_TKCG5</name><description>Channel 5 sample time
              selection</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP6_TKCG6</name><description>Channel 6 sample time
              selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP7_TKCG7</name><description>Channel 7 sample time
              selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP8_TKCG8</name><description>Channel 8 sample time
              selection</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP9_TKCG9</name><description>Channel 9 sample time
              selection</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>IOFR1</name><description>injected channel data offset register x</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET1</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>IOFR2</name><description>injected channel data offset register x</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET2</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>IOFR3</name><description>injected channel data offset register x</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET3</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>IOFR4</name><description>injected channel data offset register x</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET4</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>WDHTR</name><description>watchdog higher threshold register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>HT</name><description>Analog watchdog higher threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>WDLTR</name><description>watchdog lower threshold register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LT</name><description>Analog watchdog lower threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>RSQR1</name><description>regular sequence register 1</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SQ13</name><description>13th conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ14</name><description>14th conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ15</name><description>15th conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ16</name><description>16th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>L</name><description>Regular channel sequence length</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>RSQR2</name><description>regular sequence register 2</description><addressOffset>0x30</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SQ7</name><description>7th conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ8</name><description>8th conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ9</name><description>9th conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ10</name><description>10th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ11</name><description>11th conversion in regular sequence</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ12</name><description>12th conversion in regular sequence</description><bitOffset>25</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>RSQR3</name><description>regular sequence register 3;TKEY_V_CHANNEL</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><fields><field><name>SQ1</name><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ2</name><description>2nd conversion in regular
              sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ3</name><description>3rd conversion in regular
              sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ4</name><description>4th conversion in regular
              sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ5</name><description>5th conversion in regular
              sequence</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ6</name><description>6th conversion in regular
              sequence</description><bitOffset>25</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ1__CHSEL</name><description>1st conversion in regular
