Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
              sequence;TKDY_V channel select</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>ISQR</name><description>injected sequence register</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JSQ1</name><description>1st conversion in injected sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>JSQ2</name><description>2nd conversion in injected sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>JSQ3</name><description>3rd conversion in injected sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>JSQ4</name><description>4th conversion in injected sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>JL</name><description>Injected sequence length</description><bitOffset>20</bitOffset><bitWidth>2</bitWidth></field></fields></register><register><name>IDATAR1</name><description>injected data register x_Charge data offset for injected channel x</description><addressOffset>0x3C</addressOffset><size>32</size><access>read-write</access><fields><field><name>JDATA</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>IDATA0_7_TKCGOFFSET</name><description>Injected data_Touch key charge data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>IDATA8_15</name><description>Injected data</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>IDATAR2</name><description>injected data register x</description><addressOffset>0x40</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>IDATAR3</name><description>injected data register x</description><addressOffset>0x44</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>IDATAR4</name><description>injected data register x</description><addressOffset>0x48</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JDATA</name><description>Injected data</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>RDATAR</name><description>regular data register_start and discharge time register</description><addressOffset>0x4C</addressOffset><size>32</size><access>read-write</access><fields><field><name>DATA</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field><field><name>ADC2DATA</name><bitOffset>16</bitOffset><bitWidth>16</bitWidth></field><field><name>DATA0_7_TKACT_DCG</name><description>Regular data_Touch key start and discharge time register</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>DATA8_15</name><description>Regular data</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral><name>ADC2</name><description>12-bit ADC unit 2 / TouchKey block</description><baseAddress>0x40012800</baseAddress><groupName>ADC</groupName><addressBlock><offset>0x0</offset><size>0x50</size><usage>registers</usage></addressBlock><interrupt><name>ADC1_2</name><description>ADC1_2</description><value>34</value></interrupt><registers><register><name>STATR</name><description>status register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>AWD</name><description>Analog watchdog flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>EOC</name><description>Regular channel end of conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOC</name><description>Injected channel end of conversion</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>JSTRT</name><description>Injected channel start flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>STRT</name><description>Regular channel start flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR1</name><description>control register 1/TKEY_V_CTLR</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>AWDCH</name><description>Analog watchdog channel select bits</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>EOCIE</name><description>Interrupt enable for EOC</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDIE</name><description>Analog watchdog interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>JEOCIE</name><description>Interrupt enable for injected channels</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SCAN</name><description>Scan mode enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDSGL</name><description>Enable the watchdog on a single channel in scan mode</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>JAUTO</name><description>Automatic injected group conversion</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>DISCEN</name><description>Discontinuous mode on regular channels</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>JDISCEN</name><description>Discontinuous mode on injected channels</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>DISCNUM</name><description>Discontinuous mode channel count</description><bitOffset>13</bitOffset><bitWidth>3</bitWidth></field><field><name>DUALMOD</name><description>Dual mode selection</description><bitOffset>16</bitOffset><bitWidth>4</bitWidth></field><field><name>JAWDEN</name><description>Analog watchdog enable on injected channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>AWDEN</name><description>Analog watchdog enable on regular channels</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR2</name><description>control register 2</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ADON</name><description>A/D converter ON / OFF</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CONT</name><description>Continuous conversion</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CAL</name><description>A/D calibration</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>RSTCAL</name><description>Reset calibration</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DMA</name><description>Direct memory access mode</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>ALIGN</name><description>Data alignment</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>JEXTSEL</name><description>External event select for injected group</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>JEXTTRIG</name><description>External trigger conversion mode for injected channels</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>EXTSEL</name><description>External event select for regular group</description><bitOffset>17</bitOffset><bitWidth>3</bitWidth></field><field><name>EXTTRIG</name><description>External trigger conversion mode for regular channels</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>JSWSTART</name><description>Start conversion of injected channels</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>SWSTART</name><description>Start conversion of regular channels</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TSVREFE</name><description>Temperature sensor and VREFINT enable</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>SAMPTR1</name><description>sample time register 1</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><fields><field><name>SMP10</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP11</name><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP12</name><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP13</name><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP14</name><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP15</name><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP16</name><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP17</name><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP10_TKCG10</name><description>Channel 10 sample time
              selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP11_TKCG11</name><description>Channel 11 sample time
              selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP12_TKCG12</name><description>Channel 12 sample time
              selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP13_TKCG13</name><description>Channel 13 sample time
              selection</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP14_TKCG14</name><description>Channel 14 sample time
              selection</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP15_TKCG15</name><description>Channel 15 sample time
              selection</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP16_TKCG16</name><description>Channel 16 sample time
              selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP17_TKCG17</name><description>Channel 17 sample time
              selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>SAMPTR2</name><description>sample time register 2</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><fields><field><name>SMP0</name><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP1</name><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP2</name><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP3</name><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP4</name><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP5</name><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP6</name><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP7</name><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP8</name><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP9</name><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP0_TKCG0</name><description>Channel 0 sample time
              selection</description><bitOffset>0</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP1_TKCG1</name><description>Channel 1 sample time
              selection</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP2_TKCG2</name><description>Channel 2 sample time
              selection</description><bitOffset>6</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP3_TKCG3</name><description>Channel 3 sample time
              selection</description><bitOffset>9</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP4_TKCG4</name><description>Channel 4 sample time
              selection</description><bitOffset>12</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP5_TKCG5</name><description>Channel 5 sample time
              selection</description><bitOffset>15</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP6_TKCG6</name><description>Channel 6 sample time
              selection</description><bitOffset>18</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP7_TKCG7</name><description>Channel 7 sample time
              selection</description><bitOffset>21</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP8_TKCG8</name><description>Channel 8 sample time
              selection</description><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>SMP9_TKCG9</name><description>Channel 9 sample time
              selection</description><bitOffset>27</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>IOFR1</name><description>injected channel data offset register x</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET1</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>IOFR2</name><description>injected channel data offset register x</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET2</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>IOFR3</name><description>injected channel data offset register x</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET3</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>IOFR4</name><description>injected channel data offset register x</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>JOFFSET4</name><description>Data offset for injected channel x</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>WDHTR</name><description>watchdog higher threshold register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>HT</name><description>Analog watchdog higher threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>WDLTR</name><description>watchdog lower threshold register</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LT</name><description>Analog watchdog lower threshold</description><bitOffset>0</bitOffset><bitWidth>12</bitWidth></field></fields></register><register><name>RSQR1</name><description>regular sequence register 1</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SQ13</name><description>13th conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ14</name><description>14th conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ15</name><description>15th conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ16</name><description>16th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>L</name><description>Regular channel sequence length</description><bitOffset>20</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>RSQR2</name><description>regular sequence register 2</description><addressOffset>0x30</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SQ7</name><description>7th conversion in regular sequence</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ8</name><description>8th conversion in regular sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ9</name><description>9th conversion in regular sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ10</name><description>10th conversion in regular sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ11</name><description>11th conversion in regular sequence</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ12</name><description>12th conversion in regular sequence</description><bitOffset>25</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>RSQR3</name><description>regular sequence register 3;TKEY_V_CHANNEL</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access><fields><field><name>SQ1</name><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ2</name><description>2nd conversion in regular
              sequence</description><bitOffset>5</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ3</name><description>3rd conversion in regular
              sequence</description><bitOffset>10</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ4</name><description>4th conversion in regular
              sequence</description><bitOffset>15</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ5</name><description>5th conversion in regular
              sequence</description><bitOffset>20</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ6</name><description>6th conversion in regular
              sequence</description><bitOffset>25</bitOffset><bitWidth>5</bitWidth></field><field><name>SQ1__CHSEL</name><description>1st conversion in regular
