Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
              selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>IC3PSC</name><description>Input capture 3 prescaler</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth></field><field><name>IC3F</name><description>Input capture 3 filter</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>IC4PSC</name><description>Input capture 4 prescaler</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>IC4F</name><description>Input capture 4 filter</description><bitOffset>12</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CCER</name><description>capture/compare enable register</description><addressOffset>0x20</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CC1E</name><description>Capture/Compare 1 output enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1P</name><description>Capture/Compare 1 output Polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1NE</name><description>Capture/Compare 1 complementary output enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CC1NP</name><description>Capture/Compare 1 output Polarity</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2E</name><description>Capture/Compare 2 output enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2P</name><description>Capture/Compare 2 output Polarity</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2NE</name><description>Capture/Compare 2 complementary output enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CC2NP</name><description>Capture/Compare 2 output Polarity</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3E</name><description>Capture/Compare 3 output enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3P</name><description>Capture/Compare 3 output Polarity</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3NE</name><description>Capture/Compare 3 complementary output enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CC3NP</name><description>Capture/Compare 3 output Polarity</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4E</name><description>Capture/Compare 4 output enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4P</name><description>Capture/Compare 3 output Polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CC4NP</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNT</name><description>counter</description><addressOffset>0x24</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CNT</name><description>counter value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PSC</name><description>prescaler</description><addressOffset>0x28</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>ATRLR</name><description>auto-reload register</description><addressOffset>0x2C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ARR</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>RPTCR</name><description>repetition counter register</description><addressOffset>0x30</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>REP</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CH1CVR</name><description>capture/compare register 1</description><addressOffset>0x34</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR1</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH2CVR</name><description>capture/compare register 2</description><addressOffset>0x38</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR2</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH3CVR</name><description>capture/compare register 3</description><addressOffset>0x3C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR3</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CH4CVR</name><description>capture/compare register 4</description><addressOffset>0x40</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CCR4</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>BDTR</name><description>break and dead-time register</description><addressOffset>0x44</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DTG</name><description>Dead-time generator setup</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>LOCK</name><description>Lock configuration</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>OSSI</name><description>Off-state selection for Idle mode</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>OSSR</name><description>Off-state selection for Run mode</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>BKE</name><description>Break enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>BKP</name><description>Break polarity</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>AOE</name><description>Automatic output enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>MOE</name><description>Main output enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DMACFGR</name><description>DMA control register</description><addressOffset>0x48</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DBA</name><description>DMA base address</description><bitOffset>0</bitOffset><bitWidth>5</bitWidth></field><field><name>DBL</name><description>DMA burst length</description><bitOffset>8</bitOffset><bitWidth>5</bitWidth></field></fields></register><register><name>DMAADR</name><description>DMA address for full transfer</description><addressOffset>0x4C</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DMAR_DMAB</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register></registers></peripheral><peripheral><name>SPI1</name><description>SPI controller 1</description><baseAddress>0x40013000</baseAddress><groupName>SPI</groupName><addressBlock><offset>0x0</offset><size>0x26</size><usage>registers</usage></addressBlock><interrupt><name>SPI1</name><description>SPI1</description><value>51</value></interrupt><registers><register><name>CTLR1</name><description>control register 1</description><addressOffset>0x0</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CPHA</name><description>Clock phase</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MSTR</name><description>Master selection</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BR</name><description>Baud rate control</description><bitOffset>3</bitOffset><bitWidth>3</bitWidth></field><field><name>SPE</name><description>SPI enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LSBFIRST</name><description>Frame format</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>SSI</name><description>Internal slave select</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>SSM</name><description>Software slave management</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RXONLY</name><description>Receive only</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>DFF</name><description>Data frame format</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCNEXT</name><description>CRC transfer next</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>Hardware CRC calculation enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>BIDIOE</name><description>Output enable in bidirectional mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>BIDIMODE</name><description>Bidirectional data mode enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR2</name><description>control register 2</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>RXDMAEN</name><description>Rx buffer DMA enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TXDMAEN</name><description>Tx buffer DMA enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SSOE</name><description>SS output enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RX buffer not empty interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEIE</name><description>Tx buffer empty interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>STATR</name><description>status register</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x2</resetValue><fields><field><name>RXNE</name><description>Receive buffer not empty</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TXE</name><description>Transmit buffer empty</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CHSIDE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UDR</name><description>Underrun flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CRCERR</name><description>CRC error flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>MODF</name><description>Mode fault</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>OVR</name><description>Overrun flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BSY</name><description>Busy flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>DATAR</name><description>data register</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DR</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>CRCR</name><description>CRCR polynomial register</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x7</resetValue><fields><field><name>CRCPOLY</name><description>CRC polynomial register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>RCRCR</name><description>RX CRC register</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>RXCRC</name><description>Rx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>TCRCR</name><description>send CRC register</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TXCRC</name><description>Tx CRC register</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>I2SCFGR</name><description>SPI_I2S configure register</description><addressOffset>0x1C</addressOffset><size>16</size><access>read-write</access><fields><field><name>CHLEN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>DATLEN</name><bitOffset>1</bitOffset><bitWidth>2</bitWidth></field><field><name>CKPOL</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SSTD</name><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>PCMSYNC</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SCFG</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>I2SE</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>I2SMOD</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>I2SPR</name><addressOffset>0x20</addressOffset><size>16</size><access>read-write</access><fields><field><name>I2SDIV</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>ODD</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>MCKOE</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>HSCR</name><description>high speed control register</description><addressOffset>0x24</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue></register></registers></peripheral><peripheral><name>USART1</name><description>USART controller 1</description><baseAddress>0x40013800</baseAddress><groupName>USART</groupName><addressBlock><offset>0x0</offset><size>0x1A</size><usage>registers</usage></addressBlock><interrupt><name>USART1</name><description>USART1</description><value>53</value></interrupt><registers><register><name>STATR</name><description>Status register</description><addressOffset>0x0</addressOffset><size>16</size><access>read-write</access><resetValue>0xC0</resetValue><fields><field><name>PE</name><description>Parity error</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>FE</name><description>Framing error</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>NE</name><description>Noise error flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>ORE</name><description>Overrun error</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IDLE</name><description>IDLE line detected</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RXNE</name><description>Read data register not empty</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TC</name><description>Transmission complete</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>TXE</name><description>Transmit data register empty</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LBD</name><description>LIN break detection flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CTS</name><description>CTS flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>DATAR</name><description>Data register</description><addressOffset>0x4</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DR</name><description>Data value</description><bitOffset>0</bitOffset><bitWidth>9</bitWidth></field></fields></register><register><name>BRR</name><description>Baud rate register</description><addressOffset>0x8</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>DIV_Mantissa</name><description>Mantissa of USARTDIV</description><bitOffset>4</bitOffset><bitWidth>12</bitWidth></field><field><name>DIV_Fraction</name><description>Fraction of USARTDIV</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field></fields></register><register><name>CTLR1</name><description>Control register 1</description><addressOffset>0xC</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SBK</name><description>Send break</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>RWU</name><description>Receiver wakeup</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RE</name><description>Receiver enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TE</name><description>Transmitter enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IDLEIE</name><description>IDLE interrupt enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>RXNEIE</name><description>RXNE interrupt enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transmission complete interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TXEIE</name><description>TXE interrupt enable</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PEIE</name><description>PE interrupt enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>PS</name><description>Parity selection</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>PCE</name><description>Parity control enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>WAKE</name><description>Wakeup method</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>M</name><description>Word length</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>UE</name><description>USART enable</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>OVER8</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR2</name><description>Control register 2</description><addressOffset>0x10</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>ADD</name><description>Address of the USART node</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth></field><field><name>LBDL</name><description>lin break detection length</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>LBDIE</name><description>LIN break detection interrupt enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LBCL</name><description>Last bit clock pulse</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CPHA</name><description>Clock phase</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CPOL</name><description>Clock polarity</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CLKEN</name><description>Clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>STOP</name><description>STOP bits</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>LINEN</name><description>LIN mode enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CTLR3</name><description>Control register 3</description><addressOffset>0x14</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>EIE</name><description>Error interrupt enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>IREN</name><description>IrDA mode enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IRLP</name><description>IrDA low-power</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>HDSEL</name><description>Half-duplex selection</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>NACK</name><description>Smartcard NACK enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SCEN</name><description>Smartcard mode enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAR</name><description>DMA enable receiver</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>DMAT</name><description>DMA enable transmitter</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>RTSE</name><description>RTS enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSE</name><description>CTS enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CTSIE</name><description>CTS interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>ONEBIT</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>GPR</name><description>Guard time and prescaler register</description><addressOffset>0x18</addressOffset><size>16</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>PSC</name><description>Prescaler value</description><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field><field><name>GT</name><description>Guard time value</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth></field></fields></register></registers></peripheral><peripheral><name>DMA1</name><description>General-purpose DMA controller</description><baseAddress>0x40020000</baseAddress><groupName>DMA</groupName><addressBlock><offset>0x0</offset><size>0xA4</size><usage>registers</usage></addressBlock><interrupt><name>DMA1_Channel1</name><description>DMA1 Channel 1</description><value>27</value></interrupt><interrupt><name>DMA1_Channel2</name><description>DMA1 Channel 2</description><value>28</value></interrupt><interrupt><name>DMA1_Channel3</name><description>DMA1 Channel 3</description><value>29</value></interrupt><interrupt><name>DMA1_Channel4</name><description>DMA1 Channel 4</description><value>30</value></interrupt><interrupt><name>DMA1_Channel5</name><description>DMA1 Channel 5</description><value>31</value></interrupt><interrupt><name>DMA1_Channel6</name><description>DMA1 Channel 6</description><value>32</value></interrupt><interrupt><name>DMA1_Channel7</name><description>DMA1 Channel 7</description><value>33</value></interrupt><interrupt><name>DMA1_Channel8</name><description>DMA1 Channel8</description><value>62</value></interrupt><registers><register><name>INTFR</name><description>DMA interrupt status register (DMA_INTFR)</descript