Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
ion><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>GIF1</name><description>Channel 1 Global interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF1</name><description>Channel 1 Transfer Complete flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF1</name><description>Channel 1 Half Transfer Complete flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF1</name><description>Channel 1 Transfer Error flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF2</name><description>Channel 2 Global interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF2</name><description>Channel 2 Transfer Complete flag</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF2</name><description>Channel 2 Half Transfer Complete flag</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF2</name><description>Channel 2 Transfer Error flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF3</name><description>Channel 3 Global interrupt flag</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF3</name><description>Channel 3 Transfer Complete flag</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF3</name><description>Channel 3 Half Transfer Complete flag</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF3</name><description>Channel 3 Transfer Error flag</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF4</name><description>Channel 4 Global interrupt flag</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF4</name><description>Channel 4 Transfer Complete flag</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF4</name><description>Channel 4 Half Transfer Complete flag</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF4</name><description>Channel 4 Transfer Error flag</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF5</name><description>Channel 5 Global interrupt flag</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF5</name><description>Channel 5 Transfer Complete flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF5</name><description>Channel 5 Half Transfer Complete flag</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF5</name><description>Channel 5 Transfer Error flag</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF6</name><description>Channel 6 Global interrupt flag</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF6</name><description>Channel 6 Transfer Complete flag</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF6</name><description>Channel 6 Half Transfer Complete flag</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF6</name><description>Channel 6 Transfer Error flag</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>GIF7</name><description>Channel 7 Global interrupt flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIF7</name><description>Channel 7 Transfer Complete flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIF7</name><description>Channel 7 Half Transfer Complete flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIF7</name><description>Channel 7 Transfer Error flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>INTFCR</name><description>DMA interrupt flag clear register (DMA_INTFCR)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>CGIF1</name><description>Channel 1 Global interrupt clear</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF1</name><description>Channel 1 Transfer Complete clear</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF1</name><description>Channel 1 Half Transfer clear</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF1</name><description>Channel 1 Transfer Error clear</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF2</name><description>Channel 2 Global interrupt clear</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF2</name><description>Channel 2 Transfer Complete clear</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF2</name><description>Channel 2 Half Transfer clear</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF2</name><description>Channel 2 Transfer Error clear</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF3</name><description>Channel 3 Global interrupt clear</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF3</name><description>Channel 3 Transfer Complete clear</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF3</name><description>Channel 3 Half Transfer clear</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF3</name><description>Channel 3 Transfer Error clear</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF4</name><description>Channel 4 Global interrupt clear</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF4</name><description>Channel 4 Transfer Complete clear</description><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF4</name><description>Channel 4 Half Transfer clear</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF4</name><description>Channel 4 Transfer Error clear</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF5</name><description>Channel 5 Global interrupt clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF5</name><description>Channel 5 Transfer Complete clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF5</name><description>Channel 5 Half Transfer clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF5</name><description>Channel 5 Transfer Error clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF6</name><description>Channel 6 Global interrupt clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF6</name><description>Channel 6 Transfer Complete clear</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF6</name><description>Channel 6 Half Transfer clear</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF6</name><description>Channel 6 Transfer Error clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>CGIF7</name><description>Channel 7 Global interrupt clear</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field><field><name>CTCIF7</name><description>Channel 7 Transfer Complete clear</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>CHTIF7</name><description>Channel 7 Half Transfer clear</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>CTEIF7</name><description>Channel 7 Transfer Error clear</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field></fields></register><cluster><name>Channel%s</name><dim>8</dim><dimIncrement>0x14</dimIncrement><addressOffset>0x8</addressOffset><register><name>CFGR</name><description>DMA channel configuration register
          (DMA_CFGR)</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><fields><field><name>EN</name><description>Channel enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TCIE</name><description>Transfer complete interrupt
              enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>HTIE</name><description>Half Transfer interrupt
              enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>TEIE</name><description>Transfer error interrupt
              enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>DIR</name><description>Data transfer direction</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CIRC</name><description>Circular mode</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PINC</name><description>Peripheral increment mode</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>MINC</name><description>Memory increment mode</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>PSIZE</name><description>Peripheral size</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>MSIZE</name><description>Memory size</description><bitOffset>10</bitOffset><bitWidth>2</bitWidth></field><field><name>PL</name><description>Channel Priority level</description><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>MEM2MEM</name><description>Memory to memory mode</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>CNTR</name><description>DMA channel 1 number of data
          register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><fields><field><name>NDT</name><description>Number of data to transfer</description><bitOffset>0</bitOffset><bitWidth>16</bitWidth></field></fields></register><register><name>PADDR</name><description>DMA channel 1 peripheral address
          register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><fields><field><name>PA</name><description>Peripheral address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>MADDR</name><description>DMA channel 1 memory address
