Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
          register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><fields><field><name>MA</name><description>Memory address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register></cluster></registers></peripheral><peripheral><name>PFIC</name><description>Program Fast Interrupt Controller</description><baseAddress>0xE000E000</baseAddress><groupName>PFIC</groupName><addressBlock><offset>0x0</offset><size>0xD14</size><usage>registers</usage></addressBlock><registers><register><name>SCTLR</name><description>PFIC system control register.</description><addressOffset>0xD10</addressOffset><size>32</size><access>read-write</access><fields><field><name>SYSRESET</name><description>Request an MCU-wide software reset.</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register></registers></peripheral><peripheral><name>RCC</name><description>Reset and clock control block</description><baseAddress>0x40021000</baseAddress><groupName>RCC</groupName><addressBlock><offset>0x0</offset><size>0x30</size><usage>registers</usage></addressBlock><interrupt><name>RCC</name><description>RCC</description><value>21</value></interrupt><registers><register><name>CTLR</name><description>Clock control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x83</resetValue><fields><field><name>HSION</name><description>Internal High Speed clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDY</name><description>Internal High Speed clock ready flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSITRIM</name><description>Internal High Speed clock trimming</description><bitOffset>3</bitOffset><bitWidth>5</bitWidth><access>read-write</access></field><field><name>HSICAL</name><description>Internal High Speed clock Calibration</description><bitOffset>8</bitOffset><bitWidth>8</bitWidth><access>read-only</access></field><field><name>HSEON</name><description>External High Speed clock enable</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDY</name><description>External High Speed clock ready flag</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSEBYP</name><description>External High Speed clock Bypass</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>CSSON</name><description>Clock Security System enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLON</name><description>PLL enable</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDY</name><description>PLL clock ready flag</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>CFGR0</name><description>Clock configuration register (RCC_CFGR0)</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>SW</name><description>System clock Switch</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>SW_HSE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SW_PLL</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SWS</name><description>System Clock Switch Status</description><bitOffset>2</bitOffset><bitWidth>2</bitWidth><access>read-only</access></field><field><name>SWS_HSE</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SWS_PLL</name><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>HPRE</name><description>AHB prescaler</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><access>read-write</access></field><field><name>HPRE_DIV2</name><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>HPRE_DIV64</name><bitOffset>6</bitOffset><bitWidth>2</bitWidth></field><field><name>HPRE_DIV256</name><bitOffset>5</bitOffset><bitWidth>3</bitWidth></field><field><name>HPRE_DIV512</name><bitOffset>4</bitOffset><bitWidth>4</bitWidth></field><field><name>PPRE1</name><description>APB Low speed prescaler (APB1)</description><bitOffset>8</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PPRE1_DIV2</name><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>PPRE1_DIV8</name><bitOffset>9</bitOffset><bitWidth>2</bitWidth></field><field><name>PPRE1_DIV16</name><bitOffset>8</bitOffset><bitWidth>3</bitWidth></field><field><name>PPRE2</name><description>APB High speed prescaler (APB2)</description><bitOffset>11</bitOffset><bitWidth>3</bitWidth><access>read-write</access></field><field><name>PPRE2_DIV2</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field><field><name>PPRE2_DIV8</name><bitOffset>12</bitOffset><bitWidth>2</bitWidth></field><field><name>PPRE2_DIV16</name><bitOffset>11</bitOffset><bitWidth>3</bitWidth></field><field><name>ADCPRE</name><description>ADC prescaler</description><bitOffset>14</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>ADCPRE_DIV4</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCPRE_DIV6</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>ADCPRE_DIV8</name><bitOffset>14</bitOffset><bitWidth>2</bitWidth></field><field><name>PLLSRC</name><description>PLL entry clock source</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLXTPRE</name><description>HSE divider for PLL entry</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLMULL</name><bitOffset>18</bitOffset><bitWidth>4</bitWidth></field><field><name>PLLSRC_HSE</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>USBPRE</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>MCO</name><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field><field><name>MCO_SYSCLK</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field><field><name>MCO_HSE</name><bitOffset>25</bitOffset><bitWidth>2</bitWidth></field><field><name>MCO_PLL</name><bitOffset>24</bitOffset><bitWidth>3</bitWidth></field></fields></register><register><name>INTR</name><description>Clock interrupt register (RCC_INTR)</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LSIRDYF</name><description>LSI Ready Interrupt flag</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSERDYF</name><description>LSE Ready Interrupt flag</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSIRDYF</name><description>HSI Ready Interrupt flag</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>HSERDYF</name><description>HSE Ready Interrupt flag</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PLLRDYF</name><description>PLL Ready Interrupt flag</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>CSSF</name><description>Clock Security System Interrupt flag</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSIRDYIE</name><description>LSI Ready Interrupt Enable</description><bitOffset>8</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDYIE</name><description>LSE Ready Interrupt Enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSIRDYIE</name><description>HSI Ready Interrupt Enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>HSERDYIE</name><description>HSE Ready Interrupt Enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PLLRDYIE</name><description>PLL Ready Interrupt Enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDYC</name><description>LSI Ready Interrupt Clear</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>LSERDYC</name><description>LSE Ready Interrupt Clear</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSIRDYC</name><description>HSI Ready Interrupt Clear</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>HSERDYC</name><description>HSE Ready Interrupt Clear</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>PLLRDYC</name><description>PLL Ready Interrupt Clear</description><bitOffset>20</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field><field><name>CSSC</name><description>Clock security system interrupt clear</description><bitOffset>23</bitOffset><bitWidth>1</bitWidth><access>write-only</access></field></fields></register><register><name>APB2PRSTR</name><description>APB2 peripheral reset register (RCC_APB2PRSTR)</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>AFIORST</name><description>Alternate function I/O reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPARST</name><description>IO port A reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPBRST</name><description>IO port B reset</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPCRST</name><description>IO port C reset</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPDRST</name><description>IO port D reset</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1RST</name><description>ADC 1 interface reset</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC2RST</name><description>ADC 2 interface reset</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1RST</name><description>TIM1 timer reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1RST</name><description>SPI 1 reset</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1RST</name><description>USART1 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPERST</name><description>IO port E reset</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1PRSTR</name><description>APB1 peripheral reset register (RCC_APB1PRSTR)</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TIM2RST</name><description>Timer 2 reset</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3RST</name><description>Timer 3 reset</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGRST</name><description>Window watchdog reset</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2RST</name><description>USART 2 reset</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1RST</name><description>I2C1 reset</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>CAN1RST</name><description>CAN1 reset</description><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field><field><name>BKPRST</name><description>Backup interface reset</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>PWRRST</name><description>Power interface reset</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4RST</name><description>Timer 4 reset</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2RST</name><description>SPI2 reset</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3RST</name><description>USART 3 reset</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2RST</name><description>I2C2 reset</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>USBRST</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>USART4RST</name><description>USART 4 reset</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>AHBPCENR</name><description>AHB Peripheral Clock enable register (RCC_AHBPCENR)</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x14</resetValue><fields><field><name>DMA1EN</name><description>DMA clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SRAMEN</name><description>SRAM interface clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>FLITFEN</name><description>FLITF clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>CRCEN</name><description>CRC clock enable</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB2PCENR</name><description>APB2 peripheral clock enable register (RCC_APB2PCENR)</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>AFIOEN</name><description>Alternate function I/O clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPAEN</name><description>I/O port A clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPBEN</name><description>I/O port B clock enable</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPCEN</name><description>I/O port C clock enable</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>IOPDEN</name><description>I/O port D clock enable</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC1EN</name><description>ADC1 interface clock enable</description><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ADC2EN</name><description>ADC 2 interface clock enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM1EN</name><description>TIM1 Timer clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI1EN</name><description>SPI 1 clock enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>USART1EN</name><description>USART1 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>APB1PCENR</name><description>APB1 peripheral clock enable register (RCC_APB1PCENR)</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>TIM2EN</name><description>Timer 2 clock enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM3EN</name><description>Timer 3 clock enable</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>TIM4EN</name><description>Timer 4 clock enable</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>WWDGEN</name><description>Window watchdog clock enable</description><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field><field><name>USART2EN</name><description>USART 2 clock enable</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>SPI2EN</name><description>SPI2 clock enable</description><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field><field><name>USART3EN</name><description>USART 3 clock enable</description><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C1EN</name><description>I2C 1 clock enable</description><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field><field><name>I2C2EN</name><description>I2C 2 clock enable</description><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field><field><name>BKPEN</name><description>Backup interface clock enable</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth></field><field><name>PWREN</name><description>Power interface clock enable</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field><field><name>USBEN</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field><field><name>USART4EN</name><description>USART 4 clock enable</description><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>BDCTLR</name><description>Backup domain control register (RCC_BDCTLR)</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>LSEON</name><description>External Low Speed oscillator enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSERDY</name><description>External Low Speed oscillator ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>LSEBYP</name><description>External Low Speed oscillator bypass</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>RTCSEL</name><description>RTC clock source selection</description><bitOffset>8</bitOffset><bitWidth>2</bitWidth><access>read-write</access></field><field><name>RTCSEL_LSE</name><bitOffset>8</bitOffset><bitWidth>1</bitWidth></field><field><name>RTCSEL_LSI</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>RTCSEL_HSE</name><bitOffset>8</bitOffset><bitWidth>2</bitWidth></field><field><name>RTCEN</name><description>RTC clock enable</description><bitOffset>15</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>BDRST</name><description>Backup domain software reset</description><bitOffset>16</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>RSTSCKR</name><description>Control/status register (RCC_RSTSCKR)</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0xC000000</resetValue><fields><field><name>LSION</name><description>Internal low speed oscillator enable</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LSIRDY</name><description>Internal low speed oscillator ready</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>RMVF</name><description>Remove reset flag</description><bitOffset>24</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PINRSTF</name><description>PIN reset flag</description><bitOffset>26</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>PORRSTF</name><description>POR/PDR reset flag</description><bitOffset>27</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>SFTRSTF</name><description>Software reset flag</description><bitOffset>28</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>IWDGRSTF</name><description>Independent watchdog reset flag</description><bitOffset>29</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>WWDGRSTF</name><description>Window watchdog reset flag</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>LPWRRSTF</name><description>Low-power reset flag</description><bitOffset>31</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>AHBRSTR</name><description>AHB reset register (RCC_APHBRSTR)</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue></register><register><name>CFGR2</name><description>Clock configuration register2 (RCC_CFGR2)</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue></register></registers></peripheral><peripheral><name>FLASH</name><description>Flash interface controller</description><baseAddress>0x40022000</baseAddress><groupName>FLASH</groupName><addressBlock><offset>0x0</offset><size>0x28</size><usage>registers</usage></addressBlock><interrupt><name>FLASH</name><description>Flash</description><value>20</value></interrupt><registers><register><name>ACTLR</name><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access></register><register><name>KEYR</name><description>Flash key register</description><addressOffset>0x4</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FKEYR</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OBKEYR</name><description>Flash option key register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>OBKEYR</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>STATR</name><description>Status register</description><addressOffset>0xC</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>BSY</name><description>Busy</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>PGERR</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>WRPRTERR</name><description>Write protection error</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field><field><name>EOP</name><description>End of operation</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-write</access></field></fields></register><register><name>CTLR</name><description>Control register</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access><resetValue>0x80</resetValue><fields><field><name>PG</name><description>Programming</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>PER</name><description>Page Erase</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>MER</name><description>Mass Erase</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTPG</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTER</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>STRT</name><description>Start</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>LOCK</name><description>Lock</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field><field><name>OPTWRE</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field><field><name>ERRIE</name><description>Error interrupt enable</description><bitOffset>10</bitOffset><bitWidth>1</bitWidth></field><field><name>EOPIE</name><description>End of operation interrupt enable</description><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field><field><name>FAST_LOCK</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE_PG</name><description>Fast programming</descri