Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
ption><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE_ER</name><description>Fast erase</description><bitOffset>17</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE_BER32</name><bitOffset>18</bitOffset><bitWidth>1</bitWidth></field><field><name>PAGE_BER64</name><bitOffset>19</bitOffset><bitWidth>1</bitWidth></field><field><name>PG_STRT</name><bitOffset>21</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>ADDR</name><description>Flash address register</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>FAR</name><description>Flash Address</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>OBR</name><description>Option byte register</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access><resetValue>0x3FFFFFC</resetValue><fields><field><name>OPTERR</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>RDPRT</name><description>Read protection</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>USER</name><bitOffset>2</bitOffset><bitWidth>8</bitWidth></field><field><name>WDG_SW</name><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>BFB2</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>WPR</name><description>Write protection register</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>WRP</name><description>Write protect</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>MODEKEYR</name><description>Mode select register</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue></register></registers></peripheral><peripheral><name>CRC</name><description>CRC calculation unit</description><baseAddress>0x40023000</baseAddress><groupName>CRC</groupName><addressBlock><offset>0x0</offset><size>0xC</size><usage>registers</usage></addressBlock><registers><register><name>DATAR</name><description>Data register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0xFFFFFFFF</resetValue><fields><field><name>DR</name><description>Data Register</description><bitOffset>0</bitOffset><bitWidth>32</bitWidth></field></fields></register><register><name>IDATAR</name><description>Independent Data register</description><addressOffset>0x4</addressOffset><size>8</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>IDR_IDATAR</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth></field></fields></register><register><name>CTLR</name><description>Control register</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue><fields><field><name>RESET</name><description>Reset bit</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral><peripheral><name>OPA</name><description>Dual operational-amplifier / comparator block</description><baseAddress>0x40023804</baseAddress><groupName>OPA</groupName><addressBlock><offset>0x0</offset><size>0x4</size><usage>registers</usage></addressBlock><registers><register><name>CR</name><description>Control register</description><addressOffset>0x0</addressOffset><size>32</size><access>read-write</access><resetValue>0x0</resetValue></register></registers></peripheral><peripheral><name>USBD</name><description>USB device-only interface</description><baseAddress>0x50000000</baseAddress><groupName>USBFSD</groupName><addressBlock><offset>0x0</offset><size>0x5C</size><usage>registers</usage></addressBlock><interrupt><name>USB_HP_CAN1_TX</name><description>USB HP and CAN1 TX</description><value>35</value></interrupt><interrupt><name>USB_LP_CAN1_RX0</name><description>USB LP and CAN1RX0</description><value>36</value></interrupt><interrupt><name>USBWakeUp</name><description>USB Wake up from suspend</description><value>58</value></interrupt><registers><register><name>BASE_CTRL</name><description>USB base control.</description><addressOffset>0x0</addressOffset><size>8</size><access>read-write</access><fields><field><name>DMA_EN</name><description>DMA enable and DMA interrupt enable for USB.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CLR_ALL</name><description>force clear FIFO and count of USB.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>RESET_SIE</name><description>force reset USB SIE, need software clear.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>INT_BUSY</name><description>enable automatic responding busy for device mode or automatic pause for host mode during interrupt flag UIF_TRANSFER valid.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>SYS_CTRL</name><description>USB device enable and internal pullup resistance enable.</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth></field><field><name>LOW_SPEED</name><description>enable USB low speed: 0=12Mbps, 1=1.5Mbps.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>HOST_MODE</name><description>enable USB host mode: 0=device mode, 1=host mode.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UDEV_CTRL</name><description>USB device physical port control register.</description><addressOffset>0x1</addressOffset><size>8</size><access>read-write</access><fields><field><name>PORT_EN</name><description>USB device port enable.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>GP_BIT</name><description>USB device port general purpose bit.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>LOW_SPEED</name><description>USB device port low speed enable.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>DM_PIN</name><description>USB device port UD- pin status.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>DP_PIN</name><description>USB device port UD+ pin status.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field><field><name>PD_DIS</name><description>USB device port UD+/UD- pin internal pull-down resistor control.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>INT_EN</name><description>USB interrupt enable.</description><addressOffset>0x2</addressOffset><size>8</size><access>read-write</access><fields><field><name>BUS_RST</name><description>enable interrupt for USB bus reset event for USB device mode.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TRANSFER</name><description>enable interrupt for USB transfer completion.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SUSPEND</name><description>enable interrupt for USB suspend or resume event.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>HST_SOF</name><description>enable interrupt for host SOF timer action for USB host mode.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FIFO_OV</name><description>enable interrupt for FIFO overflow.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>DEV_NAK</name><description>enable interrupt for NAK responded for USB device mode.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>DEV_SOF</name><description>enable interrupt for SOF received for USB device mode.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>DEV_ADDR</name><description>USB device address.</description><addressOffset>0x3</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_USB_ADDR</name><description>bit mask for USB device address.</description><bitOffset>0</bitOffset><bitWidth>7</bitWidth></field><field><name>UDA_GP_BIT</name><description>general purpose bit.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>MIS_ST</name><description>USB miscellaneous status.</description><addressOffset>0x5</addressOffset><size>8</size><access>read-write</access><fields><field><name>DEV_ATTACH</name><description>Indicate device attached status on USB host.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>DM_LEVEL</name><description>Indicate UDM level saved at device attached to USB host.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SUSPEND</name><description>Indicate USB suspend status.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>BUS_RESET</name><description>Indicate USB bus reset status.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>R_FIFO_RDY</name><description>Indicate USB receiving FIFO ready status (not empty).</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SIE_FREE</name><description>Indicate USB SIE free status.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SOF_ACT</name><description>Indicate host SOF timer action status for USB host.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>SOF_PRES</name><description>Indicate host SOF timer presage status.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>INT_FG</name><description>USB interrupt flag.</description><addressOffset>0x6</addressOffset><size>8</size><access>read-write</access><fields><field><name>BUS_RST</name><description>bus reset event interrupt flag for USB device mode, direct bit address clear or write 1 to clear</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>TRANSFER</name><description>USB transfer completion interrupt flag, direct bit address clear or write 1 to clear.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SUSPEND</name><description>USB suspend or resume event interrupt flag, direct bit address clear or write 1 to clear.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>HST_SOF</name><description>host SOF timer interrupt flag for USB host, direct bit address clear or write 1 to clear.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>FIFO_OV</name><description>FIFO overflow interrupt flag for USB, direct bit address clear or write 1 to clear.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SIE_FREE</name><description>Indicate USB SIE free status.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>TOG_OK</name><description>Indicate current USB transfer toggle is OK.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IS_NAK</name><description>Indicate current USB transfer is NAK received.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>INT_ST</name><description>USB interrupt status.</description><addressOffset>0x7</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_UIS_ENDP</name><description>Bit mask of current transfer endpoint number for USB device mode.</description><bitOffset>0</bitOffset><bitWidth>4</bitWidth><access>read-only</access></field><field><name>MASK_TOKEN</name><description>Bit mask of current token PID code received for USB device mode.</description><bitOffset>4</bitOffset><bitWidth>2</bitWidth><access>read-only</access><enumeratedValues><enumeratedValue><name>OUT</name><description>OUT Packet</description><value>0</value></enumeratedValue><enumeratedValue><name>Rsvd</name><description>Reserved</description><value>1</value></enumeratedValue><enumeratedValue><name>IN</name><description>IN Packet</description><value>2</value></enumeratedValue><enumeratedValue><name>SETUP</name><description>Setup Packet</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>TOG_OK</name><description>Indicate current USB transfer toggle is OK.</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field><field><name>IS_NAK</name><description>Indicate current USB transfer is NAK received for USB device mode.</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth><access>read-only</access></field></fields></register><register><name>RX_LEN</name><description>USB receiving length.</description><addressOffset>0x8</addressOffset><size>32</size><access>read-write</access><fields><field><name>RX_LEN</name><description>receiving length.</description><bitOffset>0</bitOffset><bitWidth>10</bitWidth></field></fields></register><register><name>UEP4_1_MOD</name><description>endpoint 4/1 mode.</description><addressOffset>0xC</addressOffset><size>8</size><access>read-write</access><fields><field><name>UEP4_BUF_MOD</name><description>buffer mode of USB endpoint 4.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP4_TX_EN</name><description>enable USB endpoint 4 transmittal (IN).</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP4_RX_EN</name><description>enable USB endpoint 4 receiving (OUT).</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP1_BUF_MOD</name><description>buffer mode of USB endpoint 1.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP1_TX_EN</name><description>enable USB endpoint 1 transmittal (IN).</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP1_RX_EN</name><description>enable USB endpoint 1 receiving (OUT).</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP2_3_MOD</name><description>Endpoint 2/3 mode control register.</description><addressOffset>0xD</addressOffset><size>8</size><access>read-write</access><fields><field><name>UEP2_BUF_MOD</name><description>buffer mode of USB endpoint 2.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP2_TX_EN</name><description>enable USB endpoint 2 transmittal (IN).</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP2_RX_EN</name><description>enable USB endpoint 2 receiving (OUT).</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP3_BUF_MOD</name><description>buffer mode of USB endpoint 3.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP3_TX_EN</name><description>enable USB endpoint 3 transmittal (IN).</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP3_RX_EN</name><description>enable USB endpoint 3 receiving (OUT).</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP5_6_MOD</name><description>endpoint 5/6 mode.</description><addressOffset>0xE</addressOffset><size>8</size><access>read-write</access><fields><field><name>UEP5_BUF_MOD</name><description>buffer mode of USB endpoint 5.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP5_TX_EN</name><description>enable USB endpoint 5 transmittal (IN).</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP5_RX_EN</name><description>enable USB endpoint 5 receiving (OUT).</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP6_BUF_MOD</name><description>buffer mode of USB endpoint 6.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP6_TX_EN</name><description>enable USB endpoint 6 transmittal (IN).</description><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP6_RX_EN</name><description>enable USB endpoint 6 receiving (OUT).</description><bitOffset>7</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP7_MOD</name><description>endpoint 7 mode.</description><addressOffset>0xF</addressOffset><size>8</size><access>read-write</access><fields><field><name>UEP7_BUF_MOD</name><description>buffer mode of USB endpoint 7.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth><enumeratedValues><enumeratedValue><name>SINGLE</name><description>Single Buffer Mode</description><value>0</value></enumeratedValue><enumeratedValue><name>DOUBLE</name><description>Double Buffer Mode</description><value>1</value></enumeratedValue></enumeratedValues></field><field><name>UEP7_TX_EN</name><description>enable USB endpoint 7 transmittal (IN).</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>UEP7_RX_EN</name><description>enable USB endpoint 7 receiving (OUT).</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP0_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x10</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP1_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x14</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP2_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP3_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x1C</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP4_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x20</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP5_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x24</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP6_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x28</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP7_DMA</name><description>endpoint DMA buffer address.</description><addressOffset>0x2C</addressOffset><size>32</size><access>read-write</access></register><register><name>UEP0_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x30</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP0_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x32</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP0_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x33</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP1_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x34</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP1_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x36</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><desc