Alan-Jowett/HardwareAbstractionIR/evidence/wch/ch32v203g6u6/generated/ch32v203g6u6.svd
ription>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP1_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x37</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP2_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x38</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP2_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x3A</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP2_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x3B</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP3_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x3C</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP3_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x3E</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP3_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x3F</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP4_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x40</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP4_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x42</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP4_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x43</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP5_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x44</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP5_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x46</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP5_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x47</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP6_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x48</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP6_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x4A</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP6_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x4B</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP7_TX_LEN</name><description>endpoint transmit length.</description><addressOffset>0x4C</addressOffset><size>16</size><access>read-write</access></register><register><name>UEP7_TX_CTRL</name><description>endpoint control.</description><addressOffset>0x4E</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_T_RES</name><description>bit mask of handshake response type for USB endpoint X transmittal (IN).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with DATA0/DATA1 and expect ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Respond with DATA0/DATA1 and not expect ACK</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>T_TOG</name><description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>T_AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>UEP7_RX_CTRL</name><description>endpoint control.</description><addressOffset>0x4F</addressOffset><size>8</size><access>read-write</access><fields><field><name>MASK_R_RES</name><description>bit mask of handshake response type for USB endpoint X receiving (OUT).</description><bitOffset>0</bitOffset><bitWidth>2</bitWidth><enumeratedValues><enumeratedValue><name>ACK</name><description>Respond with ACK</description><value>0</value></enumeratedValue><enumeratedValue><name>None</name><description>Timeout / No Response, used for non-EP0 iso/sync transfer</description><value>1</value></enumeratedValue><enumeratedValue><name>NAK</name><description>Respond with NAK or Busy</description><value>2</value></enumeratedValue><enumeratedValue><name>STALL</name><description>Respond with STALL or Error</description><value>3</value></enumeratedValue></enumeratedValues></field><field><name>R_TOG</name><description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>AUTO_TOG</name><description>enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OTG_CR</name><description>usb otg control.</description><addressOffset>0x54</addressOffset><size>32</size><access>read-write</access><fields><field><name>DISCHARGE_VBUS</name><description>usb otg control.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>CHARGE_VBUS</name><description>usb otg control.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>IDPU</name><description>usb otg control.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>OTG_EN</name><description>usb otg control.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field><field><name>VBUS_VTH</name><description>usb otg control.</description><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field><field><name>SESS_VTH</name><description>usb otg control.</description><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field></fields></register><register><name>OTG_SR</name><description>usb otg status.</description><addressOffset>0x58</addressOffset><size>32</size><access>read-write</access><fields><field><name>VBUS_VLD</name><description>usb otg status.</description><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field><field><name>SESS_VLD</name><description>usb otg status.</description><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field><field><name>SESS_END</name><description>usb otg status.</description><bitOffset>2</bitOffset><bitWidth>1</bitWidth></field><field><name>ID_DIG</name><description>usb otg status.</description><bitOffset>3</bitOffset><bitWidth>1</bitWidth></field></fields></register></registers></peripheral></peripherals></device>